{"pages":[{"title":"categories","text":"","link":"/categories/index.html"},{"title":"关于我！","text":"大家好，我是一名前端工程师，每天会根据时间更新一下自己的博客，内容是自己所学亦或是从别处理解之个人见解，前端道路漫长，有趣之中也会有很多烦躁，所以也会更新一下夜读美文，或者经典语句，夜深人静之时，解解闷儿。","link":"/about/index.html"},{"title":"link","text":"","link":"/link/index.html"}],"posts":[{"title":"localStorage与sessionStorage简易ES6封装","text":"本文主要是对localStorage与sessionStorage进行简易的封装，有需要的小伙伴请自取！ 直接上代码 // 此为storage.js文件class Store { constructor (store) { // 检测是否支持localstorage if (!store) { console.log('不支持localStorage') return; } this._store = store; } /** * @function 设置值 * @param {string} _k 必须参数，属性 * @param {any} _v 非必须参数，属性值 */ setItem (_k, _v) { if (!this._store) return; let kType = this.getType(_k); if (kType === 'string') { this._store.setItem(_k, this.filterValue(_v)); } else { console.log('key只能为字符串！'); } } /** * @function 获取值 * @param {string} _k 必须参数，属性 */ getItem (_k) { if (!this._store) return; let res; let kType = this.getType(_k); if (kType === 'string') { res = this._store.getItem(_k); } else { console.log('key只能为字符串！'); } return res; } /** * @function 移除值 * @param {string} _k 必须参数，属性 */ removeItem (_k) { if (!this._store) return; let kType = this.getType(_k); if (kType === 'string') { res = this._store.removeItem(_k); } else { console.log('key只能为字符串！'); } } /** * @function 移除所有 */ clear () { if (!this._store) return; this._store.clear(); } /** * @function 判断类型 * @param {any} para 必须参数，判断的值 */ getType (para) { let type = typeof para; if (type === 'number' &amp;&amp; isNaN(para)) return 'NaN'; if (type !== 'object') return type; return Object.prototype.toString .call(para) .replace(/[\\[\\]]/g, '') // eslint-disable-line .split(' ')[1] .toLowerCase() } /** * @function 过滤值 * @param {any} val 必须参数，过滤的值 */ filterValue (val) { let vType = this.getType(val); let nullVal = ['null', 'undefined', 'NaN']; let stringVal = ['boolen', 'number', 'string']; if (nullVal.indexOf(vType) &gt;= 0) return ''; if (stringVal.indexOf(vType) &gt;= 0) return val; return JSON.stringify(val); }}class LocalStorage extends Store { constructor (store) { // eslint-disable-line super(store); } WX_USER_ID = 'WX_USER_ID';}class SessionStorage extends Store { constructor (store) { // eslint-disable-line super(store); } WX_SSO_TITLE = 'WX_SSO_TITLE';}const lStorage = new LocalStorage(window.localStorage || localStorage)const sStorage = new SessionStorage(window.sessionStorage || sessionStorage)export { lStorage, sStorage} 使用方式: import { lStorage, sStorage } from './storage.js'lStorage.setItem(lStorage.WX_USER_ID, ['val']);lStorage.getItem(lStorage.WX_USER_ID); // ['val']","link":"/localStorage与sessionStorage简易ES6封装/"},{"title":"心越简单，人越幸福","text":"幸福有时真的很简单！曾经总以为，要想获得幸福，需要许多外在物质的支撑。 可随着年龄的增长，你逐渐会发现，幸福更多时刻，只是一种内心的感受，与金钱名利无关。 当你拖着疲惫的身躯，加班回到家，发现城市的万千灯火里，能有一盏灯为你亮时。 当你生病住院时，能有个人陪在你身旁，为你熬药煮粥，对你不离不弃时。 当你感到快乐时，你可以找到一个人，分享你的喜悦。当你难过时，也有一个人，可以给你一个肩膀做依靠时。 幸福并不遥远，它近在咫尺。幸福也并不陌生，它就藏在我们熟悉的生活中，关键需要你用心地去发现和感知。 人人都有拥有幸福的权利，但如果你要求得太多，苛责得太多，抱怨得太多，就不容易找到它。 其实，你若能从琐碎的日常中，从柴米油盐的平凡日子里，提炼出美好的能力，也可以将日子开出绚烂的花儿。 你是否有这样的感觉，有时会感到很孤独。因为聊得来的人越来越少，可以交心的人也越来越少。 无论你做任何决定，有什么选择，周围的人，仿佛都不理解你，甚至他们还总是质疑你。 有时，你还会为此，有深深的挫败感。 但你总要知道，人这辈子，无法做到让所有人都满意，也不必让所有人都懂你，如果强求，只会让自己过得越来越疲惫。 一个前同事给我打来电话，诉说她这段时间，在工作中遇到的烦心事。 她不无委屈地说，为什么我做了一件好事，但员工都不理解我，他们只看得见眼前的利益，却看不见长远的打算。 我安慰她说，只要你心是善的，你的决定，也经得起时间的考验，那么无论他们是否明白，你都可以做到问心无愧。 她听后说到，现在我的心情释然了很多，至少还有你理解我。 当我们在做决定时，总被旁人的眼光和评价所左右，甚至我们也总想得到更多人的支持和认可。 后来才明白，在这个世上，懂你的人，不必你解释。不懂你的人，解释也无用。 人生有时，并不需要有那么多人懂你，你自己懂你自己，以及有那么一两个知己好友懂你，就足矣。 一个读者跟我说，她有一次帮客户去找房子，跟着中介，在炎炎夏日的街头跑了一天，不仅又累又热，双脚还磨起了泡。 但她当时最大的感受，反而不是抱怨身体上吃的苦，而是突然感觉到自己平时真的太幸福了。 曾经她总对自己的工作不满意，比如任务重，压力大，考核严。那时，她总拿自己，跟那些高薪高职的人相比，于是越比心里就越不平衡。 可她现在才知道，原来在这个世界上，还有比她更辛苦，更忙碌，更劳碌的人，并没有她那么好的工作条件，可以不用日晒雨淋，可以有节庆双休，也拥有更多时间上的自由。 因为她总看到，别人有着比她更优越的条件，所以会心生嫉妒，但她却没有看到别人付出的比她多。 同时，她也并不知道，只要你尽自己所能，干好自己应该干的，哪怕是一件看起来微不足道的小事，也算是成功。 其实，大多数人的不快乐，往往来源于爱比较和不知足。 凡事你若争强好胜，只会让自己越来越痛苦。 但若你懂得，怀着一颗感恩的心，去珍惜你的工作，去善待你的生活，那么你就会多一分坦然和快乐。 虽然每个人对幸福的定义不一样，但幸福的感受，往往是相似的，想要获得幸福的心，也是相同的。 也许我们会因为各种条件，机遇和环境的不同，而过上截然不同的人生，但只要我们学会给心灵减负，学会控制欲望，学会不去盲目攀比，就会让自己活得更加轻松愉快。 其实，幸福有时真的很简单。 比如你拥有一份稳定的工作，虽然它需要你忙一点，累一点，辛苦一点，但它可以让你去实现自己的人生价值，也可以让你有底气和资本去挣钱养家。 比如你拥有一个和睦的家庭，虽然父母观念老一点，孩子调皮一点，另一半的脾气大一点，但家人闲坐，灯火可亲的感觉，是那么难能可贵。 比如你拥有几个可以互诉衷肠的朋友，虽然他们有时并不能给你及时的安慰和陪伴，又或者你们之间有些小矛盾，但能有哪怕一个交心的知己，也是人生一大幸事。 但如果你将幸福看得太复杂，你的内心太浑浊，你用恶意去揣测你所遇到的人和事，那么你就会感到十分压抑和痛苦。 其实当一个人，少一些世故，多一些单纯；少一些套路，多一些真诚；少一些浮躁，多一些宁静；就会活得更加澄明、坦率和自由。","link":"/夜读20191004/"},{"title":"世界再大，也不如有人等你回家","text":"世界上最美的风景，是回家的路！最近，一则90秒的短片在朋友圈刷屏，让无数人为之动容。 夜晚，灯火阑珊。女主角依然为了工作忙得不可开交。 这样的情形，已经成了现代城市年轻人的一个缩影。 节日到了，母亲希望女儿回家一趟，言外之意还有让她相亲的意思。 但是女主角并不愿意父母干涉自己的事儿，无奈之下只好借口出游躲避回家后的“麻烦”。 当假期如约而至，女主角开始踏上自己的旅程。 旅途上的一个小插曲，无意间触动了她心中的那一份柔软： 高速路服务区，一位技工小哥，在帮她检测车辆的时候，收到了家中的电话。 为了坚守自己的岗位，方便大家的出行，就连节假日他也无法抽身回乡。与此同时，女主角的母亲也再次给她发来关心的短信。 直到这一刻女主角才发现，原来有些近在咫尺的幸福，于另外一些人而言，却是一种奢望。 视频的最后，当女主开始踏上回家旅程的那一刻，我的心中也仿佛有一块石头重重地落下。 原来，这个世界再大，也不如有人等你回家。 上周，我刚到办公室，就发现同事群里一阵骚乱。 原来国庆临近，很多同事都没有抢到火车票，有的撺掇着拼车回家，有的忙着发送抢票链接，一片慌乱。 在外工作多年，这样的场景早就是一种常态，本来我不以为意，但是同事小艾还是引起了我的注意。 小艾是公司来的新人，脾气倔得很，因为毕业后的择业问题与父母产生了一些矛盾，所以来北京这几年，即便步履维艰，她也很少回家。 但是这一次，我却见到了她在同事群连发了三条“求救信息”： “哥哥姐姐们，求加速，抢不到回家的车票啦。” 后面还缀上了一个大哭的表情。 后来，我们吃饭聊天，她说起这一件小事，不仅让她备受感动，恍然大悟，也让我感触颇深。 原来中秋的前一天是小艾的生日，她本以为自己又要孤独地长大一岁。可就在她上一秒还在和父母通电话，说放假不能回家时，公寓的门铃突然响起。 开门的那一刻，她无论如何都不会想到，外面站着的竟然是从千里之外风尘仆仆赶来的父母。 望着他们手里提着那盒她最喜欢吃的水果蛋糕，小艾瞬间泪目。 的确，父母和子女之间必将经历一场又一场的别离，但是彼此的爱不会因为距离而衰减。 他们希望你过得好，盼着你变强大，哪怕就此离家越来越远，他们也会想尽办法来到你的身边。 小艾最后告诉我：“以后每个假期我都要回家。”语气充满了坚定，也充满了幸福。 当我们努力去踏遍千山万水的时候，千万别忘了回头看一看那个随时等你回家的人。 你还记得上一次回家探望他们是什么时候吗？ 你还记得上一次打电话给他们是什么时候吗？ 你还记得上一次真正和他们敞开心扉聊天是什么时候吗？…… 很喜欢这样一首小诗： 我们的世界很大，常忽略了他们。父母的世界很小，只装满了我们。 他们经常忘了，我们已经长大。就像我们经常忘了，他们已经渐渐白发。 诚然，外面的世界很精彩，但父母绝对不应该成为被我们遗忘的一部分。 因为一直以来，只有他们才会用最笨拙的方式默默地守护着我们。 无论你身处何种境遇，父母对孩子总是充满了牵挂。 并且也终于发现不知不觉那个等自己回家的人已经渐渐老去，自己亏欠他们太多太多。 我们总说来日方长，可人生哪来那么多后会有期。 世间最美好莫过于：我已长大，你还未老；我有能力报答，而你仍然健康。 有人问“逢年过节，为什么中国人总要不远万里回家？” 知乎上有个高赞回答，只有一句话，却触动人心： 因为那是我的“家”呀，别的地方只能叫做“住的地方”。 在网上看到过这样一个故事： 因为刚刚毕业，女孩一直没能找到工作，到了年底想要回乡，身上只剩下几百块钱。 路途遥远，她买不起机票，只好买最便宜的绿皮火车票，需要在硬座上待三十几个小时。 等她终于赶回家乡的城市，早已经是凌晨一点。 但是没想到，她刚一出站，就看到了在站台上翘首以盼的父亲。 深夜的车站人烟稀少，父亲缩着脖子，哈气搓手。看到她出现，小跑着过来。 接过行李的时候，父亲说：“外面混得不好就回来，爸养你。长了不敢说，养你到40岁，爸还是有这个能力的。” 听到父亲的话，她特别想哭，心里一直堵着难过，在到家的那一刻，突然释放了。 有人说，家是一个有温度的词，它不仅是我们身体休息的地方，更是我们心灵停靠的港湾。倦鸟归林、鱼翔浅底、落叶归根，这都是对家的渴望，也是生命在追寻着的一种归宿。 你终会发现，你心中最美的风景，不是霓虹闪烁，也不是高楼大厦，而是那个有父母等你回去，无论贫穷或富有的家。","link":"/夜读20191005/"},{"title":"一个人越过越好的6个迹象","text":"活成自己喜欢的样子！看到一句很有道理的话：一个人最好的状态莫过于，眼里写满了故事，脸上却不见风霜，不羡慕谁，不嘲笑谁，也不依赖谁。只是悄悄地努力，吞下委屈，喂大格局，活成自己喜欢的样子。 深以为然。 生活不需要太多事参与，故事不需要讲给太多人听。一个人安安静静努力，慢慢靠近自己想要的生活，就足矣。 生活越来越舒服，人生越过越成熟，自己越活越坦然的六个迹象，来看看，你中了几条？ 第一条，明白赚钱的重要性，但不把攒钱当作唯一目的。 亦舒说：记得积蓄，那样有朝一日失去任何人的欢心，都可以不愁衣食地伤春悲秋，缅怀过去。 的确，你不必特别有钱，但一定不能特别缺钱。钱不是万能的，但手里多一点钱，真的能叫自己少吃些苦。 赚钱和积蓄真的是很重要的事情。 不过，我希望你也要记得，别把攒钱当作唯一目的。 银行卡上的数字不应该成为你全部的安全感来源。 这世界，除了柴米油盐，还有远方的诗和田野。 不要总是低着头朝前走，偶尔停下脚步抬头看看满天的繁星。 想想自己当下最期待的生活是什么样的，不要忘记自己年少时的初心。 就像《流金岁月》中说的：无论做什么，记得为自己而做，那就毫无怨言。 人只活一辈子，不要太苛待自己，在能力范围之内给自己更好的，也是对生命的一种馈赠。 第二条，不害怕接近爱，也不盲目付出爱。 人活在世上，总免不了经历七情六欲，亲情、爱情、友情，点头之交，擦肩陌路…… 相遇和离别，每天都在上演。 以前总想着让认识的人都喜欢自己，想和更多的人成为朋友。 待人友善是修养，独来独往是性格。你不懂我，我不怪你，淡然远之，各自安好。 不害怕与人相处，也不惧于接受谁的好感和爱意。 但绝不会因为年龄或者一些本心之外的东西选择将就一段生活。 明白自己的感情很贵，不是谁都能给，如果不值得，如果没回应，那就算了。 余生很贵，取悦好自己，照顾好值得放在心上的人，不要将就，更别浪费。 第三条，比起无聊的消遣，更愿意独处和读书。 很多快速的东西往往都很短暂，偷走了你当下的时间，却并不能在你心里留下更深刻的印象。 偶尔小幅度的放纵可以让人感到愉悦和放松，但如果把堕落当成一种快乐，时间久了，只会让自己越来越难于开始自律。 没事早点睡，有空多读书，一个人的时候别浮躁，别焦虑；沉下心去磨一磨自己的脾气和性子，在书里见天地，见众生，更见自我。 要让自己成为一块有棱角但不锋芒外露，有骨气但外表温凉柔润的美玉。 你读过的书、走过的路和爱过的人，都会成为你人生路上的指路牌。那些也许你已经忘记了的书里的片段，其实都在指引你前行的方向。它们一定会在未来的某一个时刻，帮助你表现得更出色。 所以，要主动把自己从垃圾快乐中解救出来，独处和读书，往后余生，且行且记。 第四条，懂得自律才是自由的前提，并愿意为之付诸努力。 看过这样一句话：生活中的不如意总比如意多。 而对此的恪守、热情，恰恰也缘于自身的坚韧。时刻提醒自己，要自律，要保持内在的从容与安静。 无论在人生的哪个阶段，都不能放弃成长，没有人能限制你人生的高度，只要你不要让心受限，一切都有可能。 康德说：自律即自由。 先有自律，懂得隐忍和克制，放弃一些不重要的，坚持一些优秀的；而后才能因此获得真正的自由，成为自己想要的样子。 坚持一件能够让自己变好的事的确不容易，打磨自己的过程也总是充满了艰难和迷茫。 但只要你在朝前走，只要你在朝着更优秀的方向拼搏，即使最后失败，也是最难能可贵的经历。 思考、行动、自律、坚持，共勉。 要相信，勇于大步向前走的人，总能够找到属于自己的光亮。 第五条，有些人该放就放。 人生就像一条路，从起点出发，到终点结束，不长不短刚刚好。 但在开始时，我们因过于懵懂而无法抉择，可待到结束时，回望一生却总觉得有诸多悔恨。 其实未来和过去，都不是我们该看重的东西，时光飞逝，只该抓紧今日。 珍惜现在拥有的人和事，感恩如今生命馈赠的一切，得不到的就不要去想它，已经失去的，就赶紧放下吧。 有些事得过且过，有些人该忘就忘。 别因为一时的失意就沉沦放纵，也别把悲伤和难过郁结在心里。 生活本就很苦了，但你可以学着做自己的草莓味儿； 保持健康的身体和积极的心灵，从每一个当下开始，期许新生活。 第六条，先爱自己，而后爱人。 坚持读书，写字，听歌，旅行，上网，摄影，有时唱歌，跳舞，打扫，烹饪，约会，狂欢。” 无论遇见什么，人生都在照常运转，无论离开了谁，生活也不能停滞不前。 不懂先为自己付出的人，就算为别人掏心掏肺，也会被当作理所当然； 不懂先爱自己的人，就算把自己感动得痛哭流涕，也无法真正拥有合适的爱情和生活。 先爱自己，而后爱人。 如此，便能够为了开心而保持微笑，为了幸福而变得坚韧；如此便不会为了一个不值得的人伤神沉沦，不会为了不必要的事大动肝火。 只此一世，取悦自己，真的很重要。 希望你也成为这样的人，眼里长着太阳，笑里全是坦荡。余生漫漫，且行且成长，且行，珍惜。","link":"/夜读20191006/"},{"title":"记人恩，忘人过","text":"怀包容之心，还己一份轻松！活着不易，人人都有难处，做人，应常怀慈悲心，体谅他人的难处。人无完人，人人都有不足，常怀包容心，容纳万物，少计较，少对比，放过自己，不苛责他人，多去欣赏放大他人的优点，忽略他人的不足。 俗话说，烦恼天天有，不捡自然无，心宽一分云消雾散，让人一步晴空万里。 有一种心安，叫念人恩，有一种轻松，叫忘人过，帮过我们的，铭记于心，心宽，不念人过忘人错，不忘人恩，知恩图报，不记人过，心胸开阔，不思人非，不计人怨，踏实生活！ 心宽一尺，少记人过。 古人云：“一斗米养个恩人，一石米养个仇人。” 在生活中，总有这么一类人存在，你对他十次好，一次不顺心， 他就会抹杀所有，只记得你的过错，有些人习惯了索取，便忘记了付出、感恩。 在这个世界上并不是人人都懂“良心”两个字，纵然你有千般好，只要有一个不好，就推翻了你所有的付出；哪怕你为他倾尽所有，掏心掏肺，一个过错，就会揪着不放。 这类人，你帮他一百次却从不记恩，但半次不帮就记恨在心，永不忘怀。 人都是相互的，你怎么待人，别人也会以同样的方式待你，你待别人刻薄，别人就会远离你，你待他人真诚，别人就会珍惜你。 做人，靠心，不靠嘴，用真心待人，才能换得知己，用嘴巴待人，难以换得信任。 尺有所短，寸有所长，别拿自己的标准衡量人，别用自己的眼光审视人，人人都有不足，谁都不完美，挑人过错时，嘲笑他人的缺点时，先反省一下自身。 人活着，谁都不完美，都有难言的苦。别总是挑剔别人，不去反省自己的错误。 做人，理应用放大镜看别人的优点，用显微镜看自己的缺点，因为事事都不完美，别用自己的认知去评论一件事。 人人都有不足，别用自己的心胸去度人，用自己的心眼去要求他人，理应得饶人处且饶人，放过了别人，也等于放过了自己，怀包容之心，心宽一尺，还己一份轻松！ 常记人恩，知恩图报。 常言道：“别人帮你是情分，不帮你是本分。” 做人应有良心，常怀一颗感恩之心，不要因为别人一次拒绝你，就放在心上，揪着不放，人人都有为难之处，做人应换位思考，更不要把别人曾经对你的好抛却脑后。 不要因为一点小事，就否定别人之前对你的知遇之恩，就忘记别人对你所有的好。 在生活中，理应感恩每一次遇见、相逢、重逢。感恩每一个出现在我们生命里的人，因为他们都是我们生命中的贵人！ 感恩生我养我的爸妈，把我们带到人世间，给予我们生命；为我们扛起重担，教会我们做人的道理； 感恩老师，是他们无私的奉献和付出，一路启蒙、引导着我们。授予我们知识，助我们圆梦。念师恩，一生无悔！ 感恩朋友，当我们陷入低谷时，用真挚的友谊给予鼓励与安慰。当我们遇到麻烦时，及时伸出援助之手。当我们走投无路时，愿意倾囊相助。 君子重情不忘恩，小人重财记人过，懂感恩的，贵人助，记人过的，仇怨多。 古人云，滴水之恩，当涌泉相报，忘人过，记人恩，你的格局才会越来越大，人生之路才会越走越宽。 人活一世，如露水一朝，今生为人，好好踏踏实实做人。少记人过，常记人恩。 为人要诚恳，说话要中肯，做事要讲究诚信，说话算话；交人，要懂感恩，以心换心，将心比心。学会感恩，才会知足；学会感恩，才会保持恬淡自然的心态；学会感恩，才能看清自己，路才会更宽！","link":"/夜读20191007/"},{"title":"人，绝不能让心情生病","text":"能笑，就别选择哭！散文家林清玄的书法很好。 有一天，他的朋友向他讨要一副字，考虑再三，他写下了四个字：常想一二。 朋友问，这是什么意思？ 林清玄说了这样一段话：“人生不如意事十常八九，我们生命里不如意的事占了绝大部分，因此，活着本身是痛苦的。但扣除八、九成的不如意，至少还有一、二成是如意的、快乐的、欣慰的事。我们如果要过快乐的人生，就要常想那一、二成好事，这样就会感到庆幸、懂得珍惜，就不至于被八九成的不如意所打倒了。” 的确，生活里的大部分事，总是难熬痛苦的。 上学时，要日复一日地沉浸在学业里，每日都要为成绩提心吊胆。 工作后，既要承担沉重的经济压力，提起精神面对职场上的纷纷扰扰，又要照顾好一家老小，不管多累时间却好像总是不够用。 生活不如意之事太多了，哪怕艰难地挺过所有苦难，也不一定能有大欢喜降临。 可若是整日沉浸在对痛苦的厌恶、对压力的反感中，生活就会是灰蒙蒙的一片。 不如多想想那一二如意之事，哪怕快乐少有，也要记得快乐是什么样的味道，用这样的方式去生活，才会有阳光出现。 否则，心情生了病，生活也不会见好。 读过这样一则小故事。 有兄弟二人，大约四五岁。 因为卧室里的窗户总是密闭着，他们觉得室内太过暗沉，看到外面的阳光，很是羡慕，就想了一个主意：把阳光扫进来。 于是，他们拿着笤帚和畚箕去阳台扫阳光，但当他们把畚箕拿到屋里的时候，发现阳光没了。 他们尝试了很多次，还是没有阳光，开始着急。 这时妈妈看到了他俩奇怪的动作，问：“你们在做什么呢？” 两兄弟答道：“房间太暗了，我们想扫点儿阳光进来。” 妈妈笑了：“只要把窗户打开，阳光自然会进来，何必去扫呢？” 阳光就像我们的好心情，很多人知道它能驱散黑暗，带来温暖，能让日子欢快起来，很想努力拥有，却总是得不到。 但其实，当你真正放松下来，把封闭的心门打开，就会发现原来快乐并不难，阳光般的好心情自然而然就来了。 很多时候，我们总是把自己逼得太紧，什么都想要，什么都得不到，还把自己弄得一身狼藉。 适时放松一些，心情才不会那么容易就生病。 去看看云卷云舒，去赏赏春花秋叶，日子很美，只是我们习惯于沉浸在各种功名利禄里，忽略了心情的重要性。 人生短短几十年，总要活得开心些。 有个老太太喜欢买苹果，有次她买了一筐苹果，就找烂的吃掉，好的留到明天再吃，明天再找个烂的吃，好的再留着。 她不断地吃烂苹果，最后她吃掉了一筐烂苹果。 你看，其实生活就像那筐苹果，有烂的、也有好的，全看你先吃哪个。 先吃坏苹果，一天都会是坏心情，好苹果也会在你不经意间腐烂掉。 但先吃好苹果，至少当下的心情是欢快的。 我们无法把握明天，别把快乐都留在遥远的未来，因为生命无常，世事难料，谁也无法保证未来的你终会平安喜乐。 记住，不论昨天曾发生过什么事，也不论明天有什么即将来临，你永远“置身现在”。 一旦现在的心情生病了，就很难痊愈，未来的心情也会跟着受影响。 人只有活好每一个当下，用最好的心态去面对，人生之路才不会伴随太多悲叹，明天的快乐才会按时到达。 能笑，就别选择哭，能开开心心，就别抑郁低沉。想开了，一切就通畅了。 人，绝不能让心情生病。","link":"/夜读20191008/"},{"title":"无论和谁，都别熟得太快","text":"给双方的关系多一点空间，才能有更多的来日方长！有句话呀，说得很在理：“使人有乍交之欢，不若使人无久处之厌。” 相处不累、久处不厌的秘诀到底是什么呢？ 其中，有很重要的一点便是：无论和谁，都别熟得太快。 欲速则不达的道理，同样适用于人际关系。 与人相处，切莫交浅言深。 古语有言：“骃闻，交浅而言深者，愚也。” 刚认识没多久，连对方的人品都不清楚，就将自己最深处的想法和盘托出，是不明智的。 宋朝时期，有位李郎中，开了一家中药铺。 某天呢，有个突然得了怪病的人上门来，急匆匆地请李郎中治病。 李郎中也不负“妙手回春”之名，开了几贴药，便把病治好了。 病人亲自登门道谢，李郎中更是热情款待，备上了好酒好菜，两人相谈甚欢。 推杯换盏中，李郎中聊到了自己在朝为官的幼时的邻居，还连带地说起了这个邻居不为人知的糗事，两人一起哈哈大笑，惬意得很。 过了一段时间，李郎中的中药铺遭到了官府查封，不明所以的李郎中一经打探才知道，原来是先前的那位病人将邻居的糗事传开了去。 导致邻居身边的官员纷纷在私底下窃窃私语，取笑邻居。 一向好面子的邻居气不过，就伺机地找他麻烦。 断了门路的李郎中去质问病人，病人却说：“这是秘密吗？感觉我们刚认识不久，如果是不可见人的秘密，你又怎么会告诉我呢？” 李郎中被问得哑口无言，只怪自己当初对病人还不熟识，就畅所欲言，现在后悔也晚了。 人性难辩啊，与信任的人说话尚且得小心隔墙有耳，更何况对初相识的人呢？ 也许你叮咛着说要保密的事，他转身就告诉了别人；也许你敞开心扉、诉说衷肠，他未必就能感同身受。 到头来，怪得了谁呢？ 既然交情浅，话题又何必聊得太深入呢？ 这热情过了度啊，就会缺了边界。 在人际交往当中，最令人反感的便是多管闲事，别人不想他管，他偏要插一手。 不多管闲事，并非要求人冷漠，而是要把握好分寸。 有时候热情过了度，就容易逾越本分，触碰他人的底线。 阿强曾经分享了他的经历： 他搬到新家之后呢，认识了隔壁一对很热情的夫妇，黄阿姨属于自来熟的性格，第一天认识就过来帮忙，阿强满是心怀感激。 到了傍晚，收拾得差不多的时候啊，黄阿姨看到阿强家里的盆栽，跟他说摆在电视柜旁边不好看，让他挪到屏风的旁边，说那里的风水好。 阿强客气地再三拒绝，说有自己的考虑，可是黄阿姨却自己动起手来，一边挪动一边说：“你们这些年轻人，就是不懂这些。” 阿强无奈又有点儿生气，觉得黄阿姨管得过了头。 气氛也从一开始的其乐融融，变得最后的不欢而散。 有些事儿，可能是出于好心替人张罗，但每个人都有自己的想法，也都不希望别人对自己的生活横加议论和干涉。 有些话，点到为止即可，再多说，便是对他人隐私的冒犯。 太不把自己当外人，并不是耿直的真性情，有时反而会给别人带来麻烦和困扰。 熟得太快，就容易口无遮拦，言行举止没有分寸，这是人与人相处的禁忌。 热心的分寸没把握好，就容易被误认为是刻意讨好；友善的分寸没把握好，就容易被当成是有利所图；关心的分寸没把握好，就容易被认为是多管闲事。 结果呢，好心做了坏事，弄巧成拙，尴尬得很。 对于很多人来说，得体的待人处事，胜过毫无分寸的耿直。 不随意插手，不轻易造成别人的困扰，这样的关系才最舒服。 不将自己的想法强加在别人身上，尊重别人的生活，才是真正的修养。 到什么阶段做什么事，若操之过急，反而适得其反。 每一段感情也都有着它自然发展的规律，若是因一时着急而揠苗助长，只会得不偿失。 无论与谁相处，无论再怎么相见恨晚，也别熟得太快，给双方的关系多一点空间，这样才能有更多的来日方长。 慢一点，才能有更多的时间去了解彼此； 慢一点，才能有更多的机会去看清真心； 慢一点，才能久一点。 毕竟，来得快的东西，往往去得也快。 因此，不必着急，更无须担忧，慢一点的感情，经过岁月的推敲，耐得住时光流转，更能细水长流，走得更深更远。","link":"/夜读20191009/"},{"title":"心若向阳，无畏悲伤","text":"好好做事、好好爱自己，过往不恋，当下不杂，未来不迎！尼采说过一句话：“与恶龙缠斗过久，自身亦成为恶龙；凝视深渊过久，深渊将回以凝视。” 生活中，我们常常因为遭遇到痛苦和烦恼的困扰，而感到焦虑不安。 于是，我们不断地想要摆脱这些困扰，结果却更容易深陷其中。 但其实，人生这一趟旅途，必然伴随着坎坷、困境。 顾虑太多、对事情耿耿于怀，只会让我们举步维艰；学会释怀、一念放下，才能让我们更好地洒脱前行。 正所谓：心幸福，日子才轻松；人自在，一生才值得。 同事莉莉，人长得美，工作能力强。所以领导总是在会议上对她赞赏有加。 本来是一件好事，但有些同事却因此嫉妒她，觉得她抢了别人的功劳。于是在背后偷偷抹黑她，到处说她是用了手段才得到领导的赏识。 尽管办公室内谣言已经传得满城风雨，但莉莉依然从容淡定地忙碌着自己的工作，完全没有想要解释清楚、证明自己清白的意思。 有一次，我在打印室遇到她，耐不住性子问她：“外面一直传一些对你不好的话，对你影响挺大吧？为什么你不解释一下呢？” 她一边复印看资料，一边慢悠悠地回答我：“别人都说，解释就是掩饰。如果我激动地去争辩解释，就会有人说我强词夺理；如果我反唇相讥，就会有人说我恼羞成怒。所以，我何必解释那么多呢？我只管做好自己分内的事就够了。时间啊，自然会替我证明一切。” 是啊，在日常生活中，我们总是在意周边人对自己的看法。因为别人的一点质疑和指责，就轻易改变自己。宁愿受委屈，也要做别人眼中的“老好人”，活成他们喜欢的模样。 但其实，生活从来都是自己的，与他人无关。 与其一直委曲求全，不如洒脱点，勇敢做自己。 就像诗人但丁所说的那样：“走自己的路，让别人说去吧！” 有人说：以前总是去解释去理论，是怕——怕自己得罪人，怕自己被人灭了，怕那些不停蹿动的小感受。 现在不去解释，不去理论，还是怕——怕浪费自己的时间，怕自己模糊了焦点，怕影响了品尝现世生活的胃口。 生活的道路有千万条，我们不必过于听从别人的意见、在意别人的眼光、走别人安排的路。 每个人，只有选择自己最喜欢的那条路去走，才会觉得舒服开心。 做好自己、不解释，坚定地走好自己的路。 有人说：“过去再好，回不去；曾经再美，已逝去。” 诚然，不管过往是美好还是不堪，都已经成为了过去。若是步步回头，只会越走越累；活在当下，才能过得洒脱舒服。 一位富翁，在他51岁那年破产。他只好又去经营生意、拼命赚钱。没多久，他果然又赚了许多钱。 他的朋友因此很奇怪，问他：“你的运气为什么总是这么好呢？” 富翁说：“这不是我的幸运，而是我的秘诀。” 朋友急切地问道：“你的秘诀可以说出来让大家听听吗？” 富翁笑了：“当然可以。其实也是人人都可以做到的事情。我是一个乐观主义者，无论任何事情，我从来不抱悲观态度，看淡得失。对于过去，不会留念，只会感恩；对于未来，不会担忧，只会迎接。我相信，一个人如果懂得扔下包袱，珍惜时光、活在当下，一定可以获得成功的。” 的确如此。快乐与否，取决于我们计较多少；伤心与否，取决于我们在意多少。 有一句很经典的台词：“当你紧握双手，里面什么也没有；当你打开双手，世界就在你手中。” 这个世界上，没有解不开的心结，没有过不去的经历，只有走不出的自己。 我们要做的是，学会活在当下，凡事尽力而为；不执着于得失，懂得为生活做减法。 唯有这样，才能让我们在前行的道路上走得轻盈舒服。 愿你，往事不回头，余生不将就。 好好做事、好好爱自己，过往不恋，当下不杂，未来不迎。 凡事保持一颗平常心。 歌德说过：“人之幸福，全在于心之幸福。”正所谓，物随心转，境由心造。 一个人怎样想，就会怎么样的结果。人的心态，是决定人生命运的舵手。 生活之中，保持好心态，凡事以一颗平凡心相待，即使有情绪、失落也能积极面对，不沉溺其中。那么事物就会层层展开，随着心境的转换而变好。 所谓的大千世界，都是心性产生的幻象，非虚非实，应该早点看开、放下，平常心相待。 学会用一颗平常心去看待，人生才会变得更加平静和淡定。 平常心，是一剂良药。它是迈向成功的坚实根基、是改变命运的人生利器，更是收获幸福的心灵法宝。 你有什么样的心态，就会有什么样的人生。","link":"/夜读20191010/"},{"title":"你唯一可以炫耀的是健康","text":"让自己健康地活着，才是对生命最好的交代！一名女子和丈夫外出归家，发现门口坐着三位蓄着花白胡子的老者。 夫妻俩面面相觑，对他们说：“我不知道你们是什么人，但各位也许饿了，请随我进来吃些东西吧。” 不料，他们却摆摆手，其中一位老者解释道：“我的名字叫健康，这位的名字是财富，那位叫成功，你们可以进屋讨论一下，愿意我们当中的谁进去做客。” 于是，丈夫和妻子进屋里商量。 妻子说：“我们让财富进来吧，这样我们就有用不完的金银财宝啦！” 丈夫却不同意：“亲爱的，你看我最近工作不太顺利，我们还是请成功进来更妙！” 一旁的女儿也在倾听，她建议：“为什么不请健康进来呢？这样我们一家人身体健康，就可以幸福地生活在一起了呀！” 丈夫摸摸女儿的头，转身对妻子说：“听女儿的吧，去请健康进屋做客。” 妻子遂出门问道：“敢问哪位是健康？欢迎进来做客。” 健康起身向屋中走去，财富和成功两人也站起身来，紧随其后。 妻子诧异地问财富和成功：“我只邀请了健康，为什么两位也随同而来？” 两位老者捋捋花白的胡子道： 无论健康走到哪儿，我们都会陪伴他走到哪儿，因为我们根本离不开他。但如果你没请他进屋，我们两个不论是谁进来，很快就会失去生命和活力。 看完大家都恍然大悟，试想若是被邀请进去的是财富或成功中的任何一位，这家人即使收获了短暂的欣慰和惊喜，没了健康，过不了多久一切都是虚妄。 回头想想，换做是你，又会做出什么样的选择呢？ 我们也曾为了财富争得头破血流，恼了他人害了自己；也为成功披星戴月地付出，最后却没能熬过健康这一大坎。 都说健康好比数字1，财富、事业、家庭都是0，只有稳住了1，才有后面无数的0，反之，则一无所有。 做出选择之前，老天给了那一家人机会，越是心灵澄澈的人越能发现世间最重要的所在。 记住：不是因为你成功了，才有财富、有健康，而是因为有了健康才能获得成功、守住财富。 人这一生，从哭声中醒来，又在哭声中离开。与其追问什么是死亡，倒不如认真钻研如何好好活着。 知乎上有个提问：人到中年，什么最重要？ 一个高赞回答只有五个字：健康最重要。 的确，健康最重要。 可就是这么简单的道理，多少人要在熬坏了身体后，才会重视。 茨威格在《断头皇后》里说的：她那时候还太年轻，不知道所有命运赠送的礼物，早已在暗中标好了价格。 你追求生活幸福、事业有成、父母尚在……但却忘了，这一切的基础就是拥有一个健康的身体。 身体，才是奋斗的本钱，健康，才是我们这辈子最大的财富。 你前半生拼的命，后半生身体会加倍地还。 人啊，有什么别有病，缺什么也别缺健康！ 让自己健康地活着，才是对生命最好的交代。 繁华三千，弹指刹那，百年过后，不过黄沙一抔。 人生在世几十年，腰缠万贯也好，穷困潦倒也罢，都是过眼云烟，钱再重要，也要有命来耗。 随着年龄的增长，你会发现，长时间熬夜后，头晕眼花，全身乏力，是你补再多觉也赶不走的黑眼圈； 你会发现，每逢换季时常腰背酸痛，视力开始模糊，记忆力也在衰退，干什么都提不起劲。 我们总是努力工作，拼命赚钱，到最后钱没赚到，人却病倒了，这是花再多钱也买不回身体原件。 朋友圈看过一段话：不要晒你的钱，到了医院，钱都不值钱；不要晒你的工作，倒下了，无数人会比你做得更出色；不要晒你的房，人走了，那就是在为别人做嫁衣裳；你唯一可以炫耀的，只有你的健康！ 拥有健康，财富才会慢慢堆积；拥有健康，成功才更有意义；拥有健康，幸福才能常相伴。 累的时候，别硬撑，该放手时就放手；困的时候，别熬夜，养成规律的睡眠习惯。 人生百年，犹如一瞬。 岁月给予我们的，不仅是风尘暗、朱颜改，还有山山水水，风花雪月。 愿你在有限的时光里，好好吃饭，好好睡觉，健健康康比什么都重要。","link":"/夜读20191011/"},{"title":"让你永不发脾气的5个字","text":"把情绪放一放，你面对的可能是另外一个结局！人生在世，七情六欲在所难免。谁都无法避免遇到让自己愤怒、无奈的事。然而，如果不懂得克制自己的脾气，很容易就成为情绪的奴隶，无形中伤人伤己。 尼采就曾说过：“必须想方设法控制自己的感情、情绪，不让它随便乱动。若是放任不管，就会被它牵着鼻子走，或被它冲昏头脑。” 能够控制情绪，是一个人情商的最高体现，以下5个字，是让你永不发脾气的诀窍。 第一个字：忍。 人非圣贤，谁也不能时刻都保持良好状态，但是，谁都可以通过不断的学习和改善，来慢慢调整自己，降低发脾气的频率。 常言道，忍一时风平浪静，退一步海阔天空。忍耐并不是懦弱的妥协，而是大事化小的智慧，是为了更专心走好自己的路。 第二个字：静。 容易冲动的人，很难管住自己的嘴，终日抱怨连天、喋喋不休。 殊不知，祸从口出、言多必失，如果抱怨太多，每天都处在烦躁不堪的状态，福气也就少了。 人活着，说得多不如想得远，学会沉着看待事物，学会冷静思考是非，才能在浮躁的生活里，找到属于自己的宁静。 第三个字：淡。 很多时候，人之所以感到愤怒，是因为被欲望支配，看不清自己真正想要的是什么。 正所谓，欲望越大，得失心越重，越难以获得快乐。丢失了原有的洒脱与随性，学会看淡和知足，才会离幸福更近一些。 第四个字：宽。 如果一个人总是因为一点小事就斤斤计较，心中时刻充斥着不满，哪有剩余的精力去感恩别人的付出，体验世间的美好。 记得雨果有一句广为流传的话：“世界上最宽阔的是海洋，比海洋更宽阔的是天空，比天空更宽阔的是人的心灵。” 人生最大的修养就是宽容，你若心宽似海，清风自能常伴。 第五个字：平。 唐朝有位高僧名叫拾得，一日他的朋友寒山问他：“世人谤我、欺我、辱我、笑我、轻我、贱我、恶我、骗我，我该怎么办呢？” 拾得回答说：“那你只需忍他、让他、由他、避他、耐他、敬他、不要理他，再过几年，你且看他。” 人生短短几十年，何必跟自己过不去。保持一颗平常心，接纳生活的磨难，保持一颗慈悲心，看淡旁人的诋毁与中伤，平和地看待这个世界，平静地对待自己的委屈，修一颗平常心。 永远记得，生活就像一面镜子，你用什么心态去面对它，它便会怎样去面对你，时刻保持内心的谦卑平和，你终会被这个世界善待。 人生天地之间，若白驹过隙，忽然而已。 生命中有那么多美好的事情等待我们去发现，不要把时间浪费在无谓的事情上。为一件事发脾气，到头来自己的心也会很累，有时还会口不择言，不仅伤了身边的人，说后自己也常觉得后悔。 人无完人，总有一瞬间忍不住要发脾气，不妨试着把想说的话留在明天说，想讨论的话题留在明天再议。把情绪放一放，你面对的可能是另外一个结局。 我们要做情绪的主人，而不是任由情绪主宰。当你可以控制情绪的时候，你会发现，一切正如那句诗一样： 回首向来萧瑟处，归去，也无风雨也无晴。","link":"/夜读20191013/"},{"title":"当你老了，这才是幸福","text":"幸福，其实一直在！毕淑敏曾在书中写过这样一个故事： 某个报社在报纸上进行一个征集，题目是“谁是世界上最幸福的人”。很快，成千上万的信函就汇集在了报社，报社组织了一个评选委员会，按照得票的多少，评选出票数最高的四位。 第一位：给孩子刚刚洗完澡，怀抱婴儿面带微笑的母亲。 第二位：给病人做完了一例成功手术，目送病人痊愈出院的医生。 第三位：在海滩上筑起了一座沙堡，望着自己劳动成果微笑的孩童。 第四位：写完了小说最后一个句号，合上了稿件的作家。 毕淑敏看到这些温暖的答案以后，心里却充满了悲伤，在过去的日子里，这四种幸福在她的身上其实都曾经历过。 她是个母亲，有给孩子洗过澡，有抱他在怀的时候； 她原来是医生，也有治好病人目送病人出院的时候； 她曾有过在工地上的沙堆挖过坑，恶作剧玩闹的时候； 她也出版过很多作品。 之所以感到悲伤，是因为自己身处在幸福之中，却感受不到幸福，发现不了幸福，更没有珍惜过幸福。 毕淑敏的这段感悟给了很多读者启示，也让很多身在福中不知福的人幡然醒悟。 生活中，多少人因为功名利禄等身外之物奔忙，为了爱恨情仇折磨自己，往往等到年华渐去，才发现自己在不必要的事物上，蒙蔽了双眼，浪费了太多时光。 其实，一生很短，别等你老了，才知道这些是幸福。 做想要做的事情，是幸福。 随着生活节奏的加快，很多人总是每日沉浸在担忧中，害怕自己跟不上多数人的脚步，害怕自己是脱离群众的“异类”。 殊不知，每个人有每个人的活法，有时候过于在意别人的看法，是一种负累，如果你不肯舍下沉重的心理负担，劳苦烦愁便会时刻围绕着你。 真正的幸福，往往不是你获得了多大的成功，或者被多少人喜欢，而是坚持自己的初心，做自己真正想要做的事情、走自己真正想走的路，才不负人世这一遭。 家人常伴在侧，是幸福。 不管你在何方，家都是你最温暖的港湾，是你前行路上最坚强的后盾。 不管你多疲惫，家人都是最了解你的人，他们能感同身受你笑容背后的苦。 与家人在一起，平淡的日子都是难得的幸福。 世事无常，有时间多给家人一些陪伴，别总想着等有时间了再去珍惜，更别等到所有的爱成了无法弥补的遗憾，再去无限追悔逝去的时光。 拥有健康的身体，是幸福。 有人说，当你觉得自己不够幸福、或是觉得命运待自己不公平的时候，就去凌晨两点半的医院，看看那些饱受病痛折磨的人，听听那些无法抑止的呻咛。 话虽残酷，却不无道理。 人世间生存的艰难，让许多人将生死置之度外，侥幸地以为健康能够永远透支，以至于让病痛一点点蚕食自己，离幸福越来越远。 但其实，世界上最不该被忽视的东西，就是你的健康，只有拥有健康的身体，才能更好地享受生命里的种种美好。那种种小美好组织在一起，就是我们也许从未曾察觉到的幸福。 犹记得年少时读过的一则小寓言故事：一只小狗每天都喜欢追逐自己的尾巴，可是却从未能真正碰触到。有一天，它突然问妈妈，“妈妈，到底我的幸福在哪里呢？” 妈妈微笑地看着它，“幸福就在你的尾巴上啊，虽然你感觉从未碰触得到，但是它一直跟在你的身后。” 岁月疾走，年华老去，短暂的一生中，有许多微小的幸福一直陪伴着我们：有喜欢做的事、有健康的身体、有爱你的和你爱的人相伴，这就是幸福，别等老了才知道！","link":"/夜读20191012/"},{"title":"你不知我的苦，请别指责我的路","text":"你只知道我的名字，却不知道我的故事！在《了不起的盖茨比》里，有这么一段话： 我年纪还轻，阅历不深的时候，父亲就教导过我一句话，我至今还是念念不忘。 他对我说，当你想要批评别人的时候，你就记住，这个世界上的人，并非个个都有过你拥有的那些优越条件。 深以为然。 大多数时候，我们看到的都不是真相。 不知从何时开始，很多人习惯以自我想法来猜测事物本身。 殊不知，很多事情能看到的其实只是冰山一角，你所谓的真相也只不过是你以为。 有部电视剧，就有这样一个催人泪下的情节：一位身材肥胖的大婶，在跑步机上疯狂运动。 仅仅用了两个月，就瘦了20公斤。 但突然有一天，大婶突然心脏麻痹而死了，原因是那天她坚持跑了三个多小时。 恰巧，在两个月前的同一时间点，这位大婶的前夫娶了一个身材高挑的年轻女人。 于是，大家纷纷猜测，大婶一定是受到情感刺激，所以想要变美获得老公的关注。 一时之间，很多新闻记者在头条新闻以“因欲望过剩而引发的死亡案件”报道了这位大婶的事情。 可实际上，大婶是为了救自己患上晚期肝硬化的女儿。 因为医生说，她只有减掉30公斤体重，才能把肝脏移植给女儿…… 听过这么一句话： “不要冒然评价我，你只知道我的名字，却不知道我的故事。你只听闻我做了什么，却不知道我经历过什么。” 不要轻易评价任何一个人，因为你知道的不一定是事实。 其实，在生活里也有很多类似的情况： 有人因为买了个名牌包包，就被指责拜金，殊不知，那是人家自己辛苦赚的。 有人因为不愿意出去吃饭，就被指责小气，殊不知，人家工资的大部分都要寄给家里。 有人每天手上绑着红布绳，就被评价特殊癖好，殊不知，那是她妈妈生前留给她的东西。 一个人最大的恶意，就是将自己的想法强加给他人，并随意揣测、评价。 别人的人生到底经历过什么，发生过什么，你根本想象不到，所以也不要随意评价。 很多时候，我们确实无法感同身受，但我们可以选择善良。 你没受过我的苦，请别指责我的路。 心理学上，有个词叫做“投射效应”。 指人们常常出现一种错觉，习惯以自己内心所想、所见为标准，以此来分析和判断他人，并认为对方也是这样。 于是指责别人眼界低、思维浅、见识少。 可是，你不是他，又怎知他们的喜怒哀乐。 微博上有一段话很火： “我们生活在不同的世界，你生活在一艘豪华的大船上，船上什么都有。有一辈子喝不完的美酒，还有许多跟你一样幸运登船的人。 而我抓着一块浮木努力漂啊漂，海浪一波一波拍过来，怎么躲也躲不掉，随时都有被淹死的危险，还要担惊受怕有没有鲨鱼经过。 你还问我：为什么不抽空看看海上美丽的风景？” 这世上，并不是所有人都过着一样的生活，也不是所有人一出生就有优渥的环境。 有人住高楼，有人住深沟，有人光万丈，有人一生锈。 很多时候，不是因为他们不够努力。而是当前他们根本就没有选择的权利。 就像《银魂》里说的： “和含着金汤匙出生的少爷不同，有些人光是活着就已经是拼尽全力了。” 可还总有人评价“那是因为你不够努力”“多大点事”“吃亏是福”，可那是因为有些事没有发生在你身上。 很喜欢尼采的一句话：“不乱评价别人，不轻易对别人下判断，不在人后说闲话。少去想别人如何，就是好人的做法。” 没穷过，就不要说“何不食肉糜”。没经历过我的伤，就别劝我大度。 不知我的苦，就别指责我的路。 知道闭嘴是教养，不乱评价是修养。 《礼记》有云：“君子约言，小人先言。” 意思是君子说话小心谨慎，小人说话妄言妄语。 别人的生活，不去轻易评价好坏，那是别人的选择。 不了解事情真相，尤其是自己没有亲身经历过的，不妄加评论。 没发生的事情，不要自己幻想、臆造，揣测别人的人生，造谣别人的生活。 每个人的生活方式、成长经历都不同。 他的经历你没有经历过，他的感受你无法体会，所以我们都没有资格去评价别人。 就像庄子说的：“子非鱼，焉知鱼之乐。” 不了解他人，就不要轻易评论。 孔子曾经通过言语、相貌、肢体语言等容易看到的表象，来评价自己的弟子宰予和子羽。 可是，这二人后来的发展与他的推断截然相反。 这位睿智的学者不由感叹道：“吾以言取人，失之宰予；以貌取人，失之子羽。” 不了解的事情不随便评价，是对他人的尊重，更是一种教养。 有这么一句话：如果你不了解，你就闭嘴，因为你永远不知道别人经历过什么；如果你了解，那你就更应该闭嘴。 你的一句恶意揣测，也许对当事人来说会造成无法磨灭的痛苦。 学会在该沉默的时候闭嘴，不懂的时候少说，这是一种教养。 闲谈莫论是非，不随意评价他人，不造谣，不传谣，这是一个人深入骨子里的修养。","link":"/夜读20191014/"},{"title":"再苦、再累、再难，也要坚持这些底线","text":"守住内心的闸门，才能始终守住内心的善良！底线，是做人的基础，是为人处世的关键。 只有守住内心的闸门，才不会轻易被外界所影响，才能始终守住内心的善良。 守住底线，不仅仅是知道该做什么事，更重要的是明白不该做哪些事。 第一条：再苦，不失信于朋友。 经历再大的苦，也不失信于朋友，这是安身立命的根本，这样的人值得信赖和深交。 李苦禅是现当代的著名画家，向他求画的人一直是络绎不绝。 有一天，一位老友登门拜访，一番谈笑风生之后，老友不好意思地跟李苦禅表明，这次登门主要是为了求一张画，但知道他平时繁忙，所以迟迟不敢开口。 李苦禅想了想自己最近的身体状况有点不好，但看到老友一脸难为情的样子，就不忍心拒绝。 于是，拍了拍他的肩膀说：“我们什么交情，一张画而已，不必觉得为难，这几天呢，就能给你。”老友听后开心地笑了，再三表示感谢。 李苦禅的名气大，常有事务缠身，再加上生病，整个人病恹恹的，给老友作画的事情便一拖再拖。 虽然一直记挂在心里，但想着也不急在这一两天，就把这事先放下了。 一天，一个星期，一个月，又一个月过去了，李苦禅接到的却是臂戴黑纱的老友的儿子送来的讣告，说老友已病故。 这个消息对李苦禅来说，如五雷轰顶，一想到自己有负老友所托，心中又悲伤又自责。 “早知如此，当初就不该隐瞒自己的身体状态，再苦再累也应该及时作画，那样也不至于让老友眼巴巴地等着画，最后落得一场空欢喜。” 失信于老友，让李苦禅惭愧不已，随即便挥笔画了一幅“百莲图”，题上老友的名字，盖上印章，携至后院，将画点燃，遥祭老友。 在旁人看来这也许这只是一个巧合，是一件小事，但在苦禅大师眼里，却是一件失信于朋友、欺骗朋友的大事。 经历此事后，李苦禅郑重其事地叮嘱儿子，以后若是有老友求画，一定要提醒他时间。 人活一辈子，离不开朋友。有朋友的相伴，就算再苦，也不会觉得孤苦无依。 没有哪种感情经得起欺骗的伤害。 不失信于朋友，捧出真诚之心对待友谊，才能换来朋友的真心相待。 第二条：再累，也不埋怨家人。 有一句耳熟能详的话：别人只关心你飞得高不高，只有家人关心你飞得累不累。 正所谓，关心则乱，家人正是太在意你，才会多问那么几句话，才会事无巨细地为你操心。 把不愉快的情绪迁怒于家人，将心里的不痛快撒在家人的身上，无疑是对家人一种深深的伤害，很多的矛盾和争吵也是由此开始。 网上曾有一个问题：为什么那么多人开车回家前，都要在车里坐上一会儿，发会儿呆？ 有人说，这是因为回到家，推开门就是柴米油盐，所以需要那一小会儿来调整好心情。 如此，才能不因疲惫而埋怨家人的关心是啰嗦，不因劳累而埋怨家人的帮不上忙是无能，不因为工作上的烦躁而迁怒于家人。 家人，是用来守护的，不是用来埋怨的。 有的人，当受到命运的不公对待时，心中愤懑不已，就会不自觉地埋怨起家人，“要是他们能争点气，我就不用活得那么辛苦了。” 有的人，当遭遇情感挫折时，就会怪自己的家人在小时候没有给自己足够的关爱。 有的人，当与别人相处不顺时，就会抱怨家人的相处模式给他带来了负面影响…… 似乎自己所有的缺点或是处境，都是来源于家人的错。 《我们不是天使》中说，生命从来不是公平的，得到多少，便要靠那个多少做到最好，努力地生活下去。 我们如此，家人亦是。 所以，再累也不埋怨家人，这是一个人的修养，因为他已然明白，谁才是真正爱自己的人，而自己又应该对人生承担起什么责任。 第三条：再难，不自暴自弃。 曾看过一位禅师跟弟子的经典对话： 弟子问：“怎样才能避开烦恼呢？” 禅师反问：“为什么要避开呢？” 禅师的话引人深思。在常人的眼里，烦恼就像是洪水猛兽，让人望而生畏，只想逃避。 而在禅师看来，烦恼却并非坏事。人，很多时候，便是在逆境和艰难中成长起来的。 其实，没有哪一种命运是对人的惩罚。因一时的打击而一蹶不振、自暴自弃，才是最大的悲剧。 如果当初孙膑因自身的残疾而自甘堕落，就没有后来奠定了齐国霸业的马陵之战的辉煌胜利； 如果当初王阳明因被人嘲笑又笨又傻而自怨自艾，就没有了后来独树一帜的阳明心学； 如果当初蒲松龄因屡考屡败而妄自菲薄，就不会有后来闻名于世的《聊斋志异》。 一个人，如果因眼前的迷茫而一路地垂头丧气，那他就会错过清风、错过鲜花，错过一切值得人欣喜的事。 如果因眼前的挫折就自轻自贱，那他便会错过更好的自己以及更光明的未来。 正所谓“艰难困苦，玉汝于成”，要想有所成就，就要经受得住考验。 遇到了难题，要保持好心态，不要被困难吓倒，踏踏实实地做好该做的，相信终有一天能够得到自己想要的。 再苦，也不欺骗朋友，方能收获真诚的友情； 再累，决不埋怨家人，方能珍惜家人的可贵； 再难，定不自暴自弃，方能迎接光明的未来。","link":"/夜读20191015/"},{"title":"联不联系，依然惦记","text":"见或不见，依然思念！最近在朋友圈看到一句话，让我很有感触：“见或不见，依然思念，联不联系，都没忘记。” 生活节奏越来越快，让人来不及喘口气，很多曾经那么亲近的朋友，逐渐也淡了联系。只有逢年过节的时候，才会发个信息，寒暄几句，转眼，又投身到焦头烂额的琐事里。 不知不觉间，我们都已经不再年轻，身上肩负着沉甸甸的责任，不敢再任性。忙不完的工作，做不完的事情，时间总是不够用，除了咬牙奋斗，我们别无选择。 回想起过去，也会有点失落。如今的我们，除了曾经那些回忆，似乎已经找不到太多话题。你有你的圈子，我有我的生活，我们渐渐成为了最熟悉的陌生人。 但我始终认定，不常联系，不代表没有惦记，不常见面，也不会抹去过往的情谊。每当看到朋友发来的信息，还是会发自内心地开心。 也许，我已经不太了解他们现在的生活，但偶尔，还是在他们的朋友圈留下一个赞，只是希望他们知道，即使平时没什么时间聊天，我也依然默默关注着。 前段时间，我见了一位老朋友。在此之前，我们大概有三四年没有见过面了，平时因为各自工作繁忙，也少有联络。 本以为会有点尴尬，但竟然丝毫没有这样的感觉。我们坐在一起畅聊了整晚，聊了近况，也聊到从前，直到天快亮起也都毫无倦意，就好像这几年的空白都从未有过一样。 我想，真正懂得珍惜的感情，大抵就是如此。就算现实中隔了千山万水，但心却从未远离。 朋友，就像天边的星星，虽然不一定常常想起，但你知道，他们一直都在。 哪怕已很久没有联系过，每每回忆起来，还是会心里一暖。因为有他们的存在，才使自己这一路走来，不那么孤单。 真正的朋友，不在身边，却在心里，不论远近，只论真心。他们未必会在你春风得意时为你锦上添花，但定会在你失落绝望时，为你雪中送炭。 这一生中，我们会遇见很多人，但不是每个人都能走进心里，占据一席之地。 不需要你常常对我嘘寒问暖，也不用没事见面聊天，只要让我知道你过得很好，我就已经心安。你遇到麻烦，我会毫不犹豫地伸出援手，我有了难题，你也会尽你所能地帮衬。 时间冲不散交情，以心换心，方能永远。 不联系，不代表就忘记；不问候，不代表不关心。我相信，真正的感情像好酒，时间越久，滋味越醇，这份感情永远不会过期。 冯音是我大学时期最好的朋友。那时的我们简单快乐，可以压马路聊很久的心事，一起交流对未来的憧憬与向往。一直觉得，生命中出现这样一位朋友，是何其有幸。 如今的我们，褪去了年少轻狂，走向了成熟稳重，工作、生活在两个不同的城市中，不再像从前那样，可以说走就走，说见就见。繁忙的工作之余，也没有多少时间，让我们再好好地谈天说地。 有一天，从她的朋友圈才突然发觉，原来那天是她的生日。心里酸涩又愧疚，什么时候开始错过了她生活的点滴呢？迟疑着发去了生日祝福，过了不久，她笑着发来语音：“咱俩还需要这个么？咱俩不需要这个。” 一句话，犹如雨后彩虹，驱赶走我内心全部的阴霾，解开了我心中所有的纠结与难过。真正的朋友就是这样，无论何时何地，无论彼此相隔多远，当初的那份情都永远不会变。默默关注，静静守候就足够。需要的时候，还是会一个电话就赶到彼此身边。 致我久未联系的朋友：天冷了，记得加衣，生病了，记得休息。无论再忙再累，也要好好照顾自己，愿你一切安好！","link":"/夜读20191016/"},{"title":"活着何必纠结，放下便是晴天","text":"唯有放下，方得平静！生活中，不可能总是诸事顺意，总是有各种来路不明的苦与难，让你陷入坏情绪当中。 但是换句话说，人和人之间心态的差距，大概就是活得快乐与否的一个很关键的要素吧。 很多问题，其实只要换个角度看，你就会发现，生活轻松了很多。 如果你觉得苦—— 据说人悲伤的极限是5天，很多苦恼忧愁，其实都没什么大不了。 只是在你那个情境下，在那种心情里，庸人自扰罢了。 所以，无论发生什么，请先善待自己，时间一过，世界自然会好。 活着的哲学，重要的不是治愈，而是带着病痛活下去。 悲伤的事，明天再说。 而明天一早起来，你会发现，地球照转，而你安好。 如果你觉得累—— 家务，工作，孩子……每天在夹缝中生存，忙到窒息。 每天得空坐下来的时候，巴不得就此睡到地老天荒。 在实在喘不过来气的时候，不妨出去走走。 去听听鸟鸣，闻闻花香，看看红叶，睡睡懒觉，回来后，重新出发。 累，是正常的。 当你做好了自我调节，自我休整，照顾好自己的身心，才会有更好的力气去迎接新的挑战。 你可以把生活看成一个轮回，在休憩和奋斗中切换，以找到自身的自在和平衡。 如果你觉得痛—— 有句老话叫：心软是病，情深致命。 人啊，总想自私地占有一切，但最终你会发现，其实什么都不属于你。而你被什么迷惑，就注定被什么所伤。 你若是太执着于已经逝去的东西，竹篮打水一场空也是迟早的，倒不如一切随风去。 正如林徽因所说：世界最遥远的距离，不是生离死别，而是对方已经云淡风轻，你却念念不忘。 唯有放下，方得平静。 如果你觉得烦—— 佛经里说：“人生有八万四千种烦恼。” 小人物有小人物的烦恼，大人物有大人物的悲辛，都是不能避免的。 当下烦了，便四处逢人诉说，但你会发现，大家不仅无法对你的烦恼感同身受，反而多了对你不痛不痒的调侃。 正如鲁迅先生所言：人类的悲欢并不相通。 与其倾诉，不如寻求方法自我排遣；与其烦恼，不如从烦恼反思，使自己在烦恼中觉悟，才是人生里烦恼的真义！ 林清玄先生说：众生以菩提为烦恼，菩提以烦恼为菩提。 再多的烦恼，到头来不过是一场虚无。正所谓本来无一物，何处惹尘埃。 看淡烦恼，看轻欲望，你会发现，烦恼原来，皆是虚无。 如果你觉得愤怒—— 人想要永远保持平静，几乎是不可能的。 总会有各种事情，各种让你触及底线，让你怒不可遏。 你会生气这个世界，有时候怎么不按规则，更多的时候，你恼于人性的自私。 可是，有句话说得好：这世间，本就是各人下雪，各人有各人的隐晦和皎洁。 你能做的，就是忽略你的生命中可有可无的琐事。 不要愤怒，愤怒会降低你的智慧；不要仇恨，仇恨会使你丧失判断。 看懂了人性，看清了世态，当你明白了这些，也就明白没什么好生气的了。 如果你有千千万万无法解决的难题—— 当你渐渐老去，岁月路上，你唯一要做的就是多爱自己，爱生活，爱自己的事业。 不论世事如何变化，无论现实让你如何累、 烦、怒、苦、痛，你要知道那都不过是当下的心境，很快就会过去。 千万不要让自己成为情绪的奴隶，更不要让自己被生活牵着走。 你要去守住你内心的平静，守护好自己的喜乐。 当千帆过境，你回望来路，就会发现：很多不快乐，其实不过如此。 活着何必纠结，放下便是晴天。","link":"/夜读20191017/"},{"title":"想明白了，你就再也不会生气了","text":"学会控制自己的情绪，对自己负责！俗话说：花是浇死的，鱼是撑死的，人是气死的！ 人生在世，每个人或多或少都有自己的脾气，每每遇到不愉快时，无名的愤怒之火会迅速占据大脑，发飙生气完全不受控制。 但不管你因何生气，到头来受伤的还是自己。 生活本来就有诸多烦恼，调整好自己的心态，学会享受当下才是最重要的。 不和旁人生气，是修养。 古时，有个叫爱巴的人，他每次和别人起争执时，就会迅速跑回家，绕着自己的房子和土地跑三圈，然后坐在田边喘气。 由于爱巴非常努力，他的房子越来越大，土地也越来越多。 而一生气，他就会绕着房子和土地跑三圈，哪怕是累得气喘吁吁，汗流浃背。 孙子问他：“阿公啊，你可不可以告诉我你一生气就绕着房子和土地跑三圈的秘密？” 爱巴对孙子说：“年轻的时候，我一和人吵架、生气，就绕着房屋跑三圈，边跑边想——我的房子这么小，土地这么少，哪来的空闲时间去和别人生气呢！想到这啊气也就消了大半，这样就有大把的时间来努力工作了。” 孙子更加疑惑了：“阿公啊！你现在这么大年纪，又是镇上最富有的人，为什么还要绕着房子和土地跑呢？” 爱巴笑着说：“我现在也还是会生气啊，边跑的时候我就边想——我房子这么大，土地这么多，又何必和人计较呢？一想到这里，气就全消了！” 把和别人生气的时间用来做有意义的事，让自己忙到没时间生气，让自己变得更加强大，这才是人生的大智慧！ 待日后回头看看，才发觉不过都是些无聊的小事而已，哪里值得我们浪费时间去生气呢？ 不可否认的是，道理人人都懂，但又有几人能做到呢？ 别再为早上没赶上那班公交而愤愤不平，即使他导致你迟到被扣了全勤； 别再为订的外卖没有准时送达而气得要投诉，即便他没能让你准时吃上饭； 也别再为刚刚水果摊的老板和你说了好几声“这个很贵”而恼火，就算他让你尴尬得无地自容…… 人生在世，不要把时间耗在无意义的事上，不要总把“不争馒头争口气”挂在嘴边。 真正有修养的人会把这口气咽下去，因为和不值得的人生气，那是自己的修养不够。 不和爱人生气，是智慧。 生活中谁都有过为各种各样的事生气的经历，夫妻之间更是如此。 但是，这个世上没有满分的另一半，只有两个五十分，凑成了一百分的两口子。 当你和爱人发生争执时，不要咄咄逼人，偶尔睁一只眼闭一只眼，给感情留个台阶下。 看过这样一个故事： 一名著名的心理学家和他的妻子，是这样调和矛盾的。 一次，他下班回家，非常疲惫，一进门却发现家里乱糟糟的，忍不住开始抱怨。 “你一整天都在家，怎么家里还这么乱，为什么你都没有整理呢？” 妻子正写着文章，头一抬，怒道：“我在家里也有自己的事忙啊，况且很多东西都是你的，你自己为什么不整理呢？” 两个人就这样你一句我一句地吵了起来。突然，先生停了下来，他说：“情况不对，我们再来一次。” 然后他就穿上衣服，拿起提包，走出家门，重新整理好心情。再次开门后，他笑盈盈地说：“亲爱的，我回来了，你今天还好吗？” 妻子也立马回应道：“我好得不得了，亲爱的，你今天好吗？” 一场家庭矛盾就此化解。 牙齿和舌头都会有磕磕碰碰的时候，两夫妻过日子互相生气也是在所难免的。但生气归生气，回来的时候别忘了顺便去菜市场把今天的菜买了。 婚姻中不要事事总是斤斤计较，非要争个你输我赢，你应该记住，家庭生活中是不能有输赢两个字的。 下次，当爱人惹你生气的时候，请静下心来默念：我选的！我选的！我选的！ 学会不生气，学会放宽心，夫妻间再大的事，都会变成往事。 最好的婚姻，不是一辈子不生气、不吵架，而是吵架了还能一辈子。 不和自己生气，是通透。 康德说过：“生气是拿别人的错误惩罚自己。”不生气，其实是放过自己，给自己“谋出路”。 之前公司有个同事特别爱生气，可能前一分钟还是笑嘻嘻地和你聊天，后一秒气氛就凝固了。 有人就说：像你这样的人啊，在宫斗剧里肯定活不过第二集。虽然这样说有点夸张，但理却是这个理儿。毕竟没有哪个老板会喜欢每天板着脸来工作的员工；也没有哪个朋友会一直忍受你莫名的负能量；更别提会有爱人用一生来承受你的“情绪暴力”。 人啊，就是要想幸福一点点，就要学会压得下脾气。 清醒的人太过较真，烦恼遍地，气急败坏容易伤身；而糊涂的人，看得通透，计较得少，却能觅得人生的大滋味。 有人问高僧：“修行需要下什么工夫吗？” 高僧说：“饿了就吃饭，困了就睡觉。” 那人又问：“一般人都是如此啊！” 高僧答：“并不一样。别人该吃饭时不肯好好地吃，偏偏要百般思索；该睡觉时不安心地睡，偏要百般计较。所以我和他们不同。” 该吃就吃，该睡就睡，这就是生活，就是智慧。 生活中许多的不愉快都是自己跟自己过不去，是自寻烦恼。要知道，日子是用来进步的，不是用来生气的。 今后，别为不值得的人生气，让自己活得贵一点儿。 人生本来就是一个减法过程。日子越过越短，能说话的人越来越少，人和人之间不过是见一面少一面。 所以，我们每个人都要学会控制自己的情绪，对自己负责。 与人为善，宽大为怀，常怀感恩之心去帮助他人，你不仅没有时间去生气，还能提升自己的修养。 当你想生气时，不妨深呼吸1分钟，然后对着镜子练习微笑，凡事多站在别人的角度考虑，反思自己的不足。 当你看见微笑着的自己，想想鸡毛般的小事，坏情绪自然会离你而去。 生气无非是为了争个高低、论个输赢，可争来争去，谁也不是最后的赢家。这一生，万事岂能尽如人意，但求无愧于心。 人呐，活着就够啦！哪来的闲情雅致去生气呢！","link":"/夜读20191018/"},{"title":"有一种修养，叫知人不评人","text":"不随意评价他人，是一种修养！你一定在工作、生活中见过这样一类人： 他们喜欢对周围的人和事评头论足，言语中透着讽刺与不屑：“A不去社交应酬，情商真够低的。” 他们往往经过简单的揣测就敢断言，罔顾事实：“B能在好单位工作，一定是靠关系。” 他们爱给他人贴上相当刻薄的标签：“C都老大不小了还骑辆破车，人生太失败了。” 这类人拼命抓住一切机会表达自己的意见，仿佛不这样做，就无处展示自己的“人生智慧”。 古人讲：“静坐常思己过，闲谈莫论人非。”不随意评价他人，是一种修养，更是一场自我的修行。 火车上，一个男孩望向火车窗外叫道：“爸爸，看，树居然在往后退！” 父亲微笑，一对年轻夫妇坐在一旁，面带同情，看着这位少年的幼稚行为。 不一会儿，男孩突然又叫道：“爸爸，看，云在和我们一起奔跑呢！” 那对年轻夫妇忍不住对男孩的父亲说：“你为什么不带你的儿子去看一个好一点的医生？” 男孩父亲笑着说：“看了，我们刚从医院回来，我儿子从出生就看不见，今天他刚能看到世界。” 年轻夫妇哑口无言。 很多人明明不了解真相，只是通过别人的某个举动或某句言论便理所当然地妄加评论，让人感觉轻率且充满恶意。 正如《了不起的盖茨比》中写道：“每逢你想要批评任何人的时候，你就记住，这个世界上所有的人，并不是个个都有过你拥有的那些优越条件。” 不是谁都有条件活得轻盈，不了解别人的过去，就不要轻易下评判；懂得不以自身在智力上、物质上的优势，去讥讽弱者，是一个人成熟的标志之一。 海明威说：“我们花了两年学会说话，却要花上六十年来学会闭嘴。” 在生活中，不少人局限在窄窄的个人偏见里，随意评价别人，背后议论他人，还以此为乐趣。殊不知，为何自己走到哪里都不受待见，不被尊重，因为没有人愿意靠近一个臭嘴巴。 知人不评人，是与人交往时的一份克制，一份自律。 作家李尚龙讲过这样一件小事。有一次，他在地铁里捧着一本莫言的《丰乳肥臀》，一个路人看了一眼书名，然后很鄙视地摇了摇头。 还有一次，李尚龙在教师休息室里捧着一本《希望永远都在》，一个老师走了进来，看了一眼书名，用很嘲弄的口气说：“你也看鸡汤啊。” 那位老师不知道的是，《希望永远都在》是一本讲柬埔寨历史的书，只是名字像鸡汤而已。 这世界从不缺发表意见的人，缺的是不随意评价他人的善良和涵养。 “水深不语，人稳不言”，层次高的人，能以包容的胸襟看待世界，不去干涉他人的生活，更不会对他人的生活指手画脚、评头论足。 管住自己的嘴巴，不说无意义的话，懂得适时沉默，是一种修养，更是一种境界。 不评价别人是一种修养，不理会别人的评价是一种修行。 世事纷繁复杂，人人都有一张嘴，管也管不了。在流言蜚语之中，专注自身，过好自己，就是对自己最好的保护。 有一位画家，将自己非常满意的一幅佳作送到画廊里展示，还特意准备了一支笔，并附言：“观赏者如果认为此画有欠佳之处，请在画上做上标记。” 结果画面上被标满了记号，被指责得一无是处。数月之后，画家又画了一张同样的画拿去画廊展示。 与上次不同的是，这次他请求每位观赏者在他们认为最欣赏之处做上标记。令人惊讶的是原先被指责的缺点，都变成了被称赞的优点。 永远有人欣赏你，也永远有人批评你，不可能做到让所有人都满意，安心做自己才是最重要的。 人生苦短，有太多美好的事物值得去欣赏，不活在他人的嘴里，更不要让别人决定自己的生活方向，才能过得坦然、自在。 正如余秋雨在《苏东坡突围》里写的：“成熟是一种明亮而不刺眼的光辉，一种圆润而不腻耳的音响，一种不理会哄闹的微笑，一种洗刷了偏激的淡漠。” 获得别人的认可，是一件幸福的事。在成长的路上，我们有时会过于渴望它，以致于太在意别人对自己的评价。 但始终，人生最曼妙的风景，是内心的淡定与从容。专注于自身，才会拥有更广阔的天空。","link":"/夜读20191019/"},{"title":"指望别人，你就输了","text":"人生中最好的贵人，是努力的自己！人这一生，为什么要努力？ 有人回答说：“做一个努力的人的好处在于，人人见了你都想帮你一把；如果你自己不做出努力的样子，即使人家想拉你，都不知道你的手在哪。” 是啊，人之所以要努力，就是为了要把命运攥在自己的手里。过于依赖别人、指望别人成全自己的人生，到头来，输的还是自己。 公司之前有一个实习生，学历不错，名牌大学毕业，人看起来也是一副聪明的样子。然而，最终他却没有顺利通过实习期。辞退的原因上写着，工作态度不积极，主动性差。 他觉得很委屈，认为自己一点儿错也没有，只是公司不识人才。于是临走前，他生气地找了他的上司理论，指责上司没有带好自己。 他是这么说的：“作为一个上司，是有义务带下属成长的。遇到困难，你不拉我一把，我怎么会懂得努力呢？” 其实，在这个世界上，根本没有人会为了你的未来买单。你要么努力向上爬，要么就深陷在泥淖里，这就是生活。 在这个世界上，总有一些时刻，是容不下你的伤春悲秋的。你的委屈、脆弱和无助，也必须要学着独自去承受和抚平。 你要知道：人生从来就没有奇迹会时常降临，除了你自己之外，没有谁可以一直被你依赖。 指望别人，你就输了。 凡事不要太怨天尤人，也不要等待他人施以援手。靠自己的力量一步步跨过泥泞，我们才能离想要的东西越来越近。 钱，要靠自己去挣；路，要靠自己去走；苦，要靠自己去尝；事，要靠自己去扛。你的美好，也要懂得靠自己去成全！ 有人觉得，独立很累很苦；也有人觉得，太过独立会遇不到人爱。 但我始终认为，比起依靠他人，指望一份没有担保的感情，投资自己，让自己变得独立而强大，才是一个人最该学会的事情。 常常听别人讲一句话：“爱哭的孩子才有糖吃，做人不必太独立、太懂事。” 但其实，这话一点儿都不对。依赖别人得到糖果，或许很简单。但你得到的，永远只是属于别人的糖果。 正如著名小说家卡夫卡所说的那样：“努力想要得到什么东西，其实只要沉着镇静、实事求是，就可以轻易地、神不知鬼不觉地达到目的。 而如果过于使劲，闹得太凶，太幼稚，太没有经验，就哭啊，抓啊，拉啊，像一个小孩扯桌布，结果却是一无所获。只不过把桌上的好东西都扯到地上，永远也得不到了。” 努力和奋斗，也许是一个很艰苦、很痛苦的过程。但只要你努力地踮起脚尖，稍稍伸一下手，就能碰触到糖果罐，吃到属于自己的糖果。 而你也会明白：自己努力获得的糖果，真的会比别人施舍的甜。 一味靠别人去满足自己的要求，指望别人成全自己的人生，最后失去的，往往更多。 唯有成为自己的贵人，人生才能一直顺风顺水。 作家余华在《没有一条道路是重复的》一书中写到：“世界上没有一条道路是重复的，没有一个人生是可以替代的。每一个人都在经历着只属于自己的生活。” 凡事不要太过于依赖别人，人生也不要指望别人去成全。 有人说，如果忘记带伞，那么就在雨中拼尽全力奔跑。也许有人觉得这听起来有些狼狈，但是那些努力奔跑的人会告诉你，靠着自己奔向目的地是一段多么痛快的旅程。也许终点等待他的未必是成功，可是过程却总是让人觉得无悔。 无悔的人生，才没有遗憾。没有遗憾，每一天都是新的开始。 你要记住：人生中最好的贵人，是努力的自己。","link":"/夜读20191020/"},{"title":"年纪不小了，那又怎样？","text":"生活从来没有标准答案！在网上看到这样一条留言：我不喜欢现在这份工作，可是又没有勇气辞职重头再来，我年纪也不小了，万一失败我不知道该如何面对，你说我该怎么办啊？ 其实，不光是她，我身边有很多人都有这样的困扰：做的工作表面上看起来很顺利，但实际上只是勉强着自己在做。 很多人做的，都不是自己想做的事，他们也在羡慕着那些，每天可以做自己想做的事情的人。 也想过辞职做自己喜欢的事，但年纪又摆在那里，也怕自己的决定会让以后的生活变得更加不好。 年龄好像变成了很多人的一个门槛，随着年龄的增长，无论是否得到了想要的生活，都开始变得愈发畏手畏脚。 那么，到了某个年纪的分水岭，人生真的就已经固定了，不能重新开始了吗？ 答案是否定的。 我们从小就被教育不要害怕接受新鲜事物，不要害怕黑暗，不要害怕摔倒，要勇敢做自己，要有追寻梦想的勇气。 但长大后，我们真的想做自己，想去实现梦想的时候，父母却开始担心了。 怕我们会一直孤身一人，怕我们没有一个稳定的未来，怕我们在这个年纪才重新开始太迟了。 实际上，如果你真的想重新开始，不管是30岁了，还是60岁了，都可以。 生活从来没有标准答案，没有人规定你必须走大家都走的路。 只不过，这一切的前提是，你真的想好了自己今后即将要面对的，你能耐得住性子受得住挫折，并且有胆量和能力为自己的选择买单。 选择放下体面的工作，就不要再对朝九晚五的规律作息不舍； 选择一条走的人少的路，就不要经常抱怨甚至掉头回去； 选择追寻诗和远方，就不要贪念舒适圈的美好。 对很多人而言，30岁好像是一个分界线。 30岁之前，好像你想做什么，你想尝试什么都不会被过分劝阻，一旦快到30岁了，安稳便成了第一要义。 但按照和大家一样的方式去生活，就真的会过得幸福吗？ 我身边有个做新媒体行业的朋友，之前在一家大公司做主编，两周前过了自己28岁生日，辞了职。 她生日那天我们一起聚了聚，出于好奇我问她，会不会觉得有点可惜。 她淡然地笑笑说：“没什么可惜的，工作的时候我拼了命工作，周末发着烧还爬起来找转载，排版，现在我想让自己稍微轻松一点，慢下来做自己喜欢的事。” 想起电影里的一句台词：你应该要学会做你自己，面对真实的自我，只要做到这一点你就什么都不用惧怕。 没有稳定的工作，没有可以走入婚姻的恋人，都没关系。 最怕的是你害怕被人嘲笑，却不敢迈出步伐，这样只会把本来一手的好牌打得稀巴烂。 无论在什么年纪，不要给自己设限，就没有什么能阻挡你。 罗曼·罗兰在书里写过这么一段话： “很多人在20岁、30岁的时候就死了，一过这个年龄，他们只不过变成了自己的影子，此后的余生不过在模仿自己中度过，日复一日，重复他们有生之年的所作所为、所思所想、所爱所恨。” 当你对生活失去了热情，当你不再对这个世界抱有好奇心，那才是真正衰老的开始。 纵使别人说：“看看你，年纪都不小了。” 希望你可以笑着回答：“那又怎样？” 只要你对未来抱有期望，只要你有勇气去做，一切都不晚。 不要等到60岁的时候，才懊恼为什么当初没有做想做的事，才遗憾明明有机会可以成为和现在不一样的人。 愿你有重新开始的勇气，也有一往直前的劲头，在有限的时间里，去一个一个完成自己想做的事。","link":"/夜读20191022/"},{"title":"做一个能扛事的成年人","text":"该承担的压力和责任，无论如何也无法逃避！你是否有这样的感受：有时在工作中，很辛苦，很疲惫，很想停下来，歇一歇，或者干脆任性地辞职算了。 可沉重的家庭负担，让你不得不咬牙硬撑，不得不负重前行，不得不告诉自己，你已经无路可退。 有时在生活中，你吃了一些亏，受了一些委屈，你很想歇斯底里地发脾气，闹情绪，尽可能地做自己。 但多方权衡利弊以后，你还是忍住了不该有的冲动，依旧理智地去说该说的话，去做该做的事。 有时在感情中，你有许多的不如意，甚至想过要放弃。 可最终你依旧选择了包容，理解和体谅对方，也在诸多的问题上，做出了适当的妥协和让步。 有一句话说，生而为人，每个人都有自己的不容易。 其实每一个成年人，都有各自的承担和责任。 或许有时我们会因为苦，而心生退意。有时会因为难，而感到压抑。甚至纠缠在一些鸡毛蒜皮的小事上，无法脱身。 但你总要知道，如果不挺住，不扛住，不熬住，你就没有资格、能力和机会，去过上你想要的生活。 因为人生当中，有许多该吃的苦，该流的汗，该受的累，你都要学会，勇敢地去面对、接纳和承受。 如今许多人，总对自己的工作，有太多怨言。 比如嫌工作时间长，工作任务重，工作环境不够好等等。 但你如果见过凌晨两点，还在大街上扫地的环卫工人，如果你见过一口气爬上了18楼，生怕超时1分钟的快递小哥； 如果你去过吊塔林立、噪音不断、灰尘满地的工地，去搬砖和泥，大概就不会感到如此愤愤不平了。 其实，无论各行各业，都有各自的难处。 如果你遇到丁点问题，就想辞职不干，那么无论你去做其他任何事，都不会有大的出息和前途。 再者，每个人都在工作上，有诸多的不顺心之处。 没有谁可以轻轻松松的赚大钱，也没有谁可以在一个看似光鲜的职位上高枕无忧一辈子，大家都在为生活奔波劳碌，没有例外。 最后，工作不是让你来开心的，也不是让你来玩的。 更多的时刻，你要在其中，投入更多的时间和精力，去创造和实现自我的价值，而不是为了单纯的享受。 在生活中，我们都有情绪低落的时刻。 或许是因令你不开心的人，或许因让你为难的事。可无论是烦恼也好，焦虑也罢，日子总要过下去。 有时你可能会感到快要崩溃，但是依旧要尽量地保持镇定；有时你很想爆发，但又不得不一次又一次地进行自我克制。 记得有人曾说，年轻的时候，连多愁善感都要渲染得惊天动地。长大后却学会，越痛越不动声色，越苦越保持沉默，成长就是将你的哭声调成了静音模式。 在感情中，我们也都有受伤的时刻。 也许我们曾因为失去某个人，就痛哭流涕，就伤心欲绝到以为天都要塌下来了。 可后来当我们再次面对分别时，虽然还是十分痛苦，却不再去强求，不再做挽留，而是懂得适时的放手。 一个人的成熟，大概就是内心可以坦然地装下更多的喜怒哀乐，也可以从容地面对更多的聚散离合。 总有人说，成年人的世界，没有容易二字。 于是我们都在寻找所谓的解脱之道。 但你总要知道，一个人虽然可以调整心态，转变思维，另寻出路，让自己活得没那么累。 但在你的人生中，该承担的压力和责任，这是无论如何，也无法逃避的。 看过这样一则故事，颇受启发。 一个背负着许多压力的人去山里见上师。 “师父，我的生活中有太多的负担和压力，好累，我快支撑不下去了。” “那就把那些负担放下。” “可是师父，我就是放不下才累啊。因为放下，反而会更累。怎么办呢？” “放不下，就背着走。” 有时，你觉得很难，并不是你真的被逼上了绝境。而是你无法坦然地承担，原本就属于你的那份不容易。 比如再好的工作，都不可能是没有压力的。再好的生活，也不会是一帆风顺的，再好的感情，也都有遇到磕磕绊绊之时。 有时，学会放下，是一种智慧。比如放下那些，已经无足轻重的人，放下那些不值一提的事，放下那些不开心的过往。 但同时承担，更是一种成熟。因为每个人在前行的路上，都应该有所担当，比如对自己负责，对家人负责，对社会负责。 愿你我，学会做一个能扛事的成年人！","link":"/夜读20191021/"},{"title":"记好这3句话，人生之路越走越容易","text":"欲成事，先成人！人这一生，必然要与形形色色的人打交道。为人处世，是每个人都要学的一门学问。 为人处世的方式和态度，往往反映了一个人的修养、层次和格局。 有句谚语说过：“欲成事，先成人。”就是说，做人与做事，是相辅相成、相互促进的； 做人是根本，做事是目的，这是一生做人做事的准则。 为人处世，或许很难，但只要记好这3句话，人生之路就会越走越容易。 第一句：人有善念，天必佑之。 古语曾说：“人行善，福虽未至，但祸已远行。人行恶，祸虽未至，福已远去。” 这句话非常有道理。 善良，是一种美德，它不仅表现出一个人的本性，更表现出一个人的处事方式。 越是善良的人，计较的东西越少，敢于承担的责任越多。 时间久了，他们的人缘也会变好，生活也会过得越顺。 前不久，有个男孩骑电动车不慎撞上了一辆停在路边价格不菲的私家车。 由于车主不在现场，他便写了一封道歉信。 并用信封装着寒假辛辛苦苦打工赚来的311块，卡在了车门把手上。 私家车主发现信封后，查看了监控。 得知这个男孩不但没有逃避责任，还主动承担责任，愿意用实际行动补偿给车主。 这样的举动，深深地感动了车主。 他决定向警方求助，希望找到这名男孩，然后把钱还给对方。 后来，车主终于找到了这个男孩，知道他品学兼优，心存善念，想拿出一万元资助他上学。 但被这个男孩拒绝了，他说：“明明是我自己的错，我已经感到内疚，怎么好意思再要这些钱呢？” 几经劝说，男孩才收下了这饱含情意的助学金。 一个勤工俭学的男孩，在遇到事情时选择勇于担当，促成这份担当的，正是他的善良。 善良，藏着一个人的运气。 你投入的善意，日后都会在某个时刻，成倍地回报给你。正所谓，人有善念，天必佑之。 心存善念的人，最终都能收获福报。 第二句：沉得住气，方成大器。 古语有云：“骐骥一跃，不能十步；驽马十驾，功在不舍。” 成功的秘诀，不在于一蹴而就，而在于你是否能够持之以恒。 若你心浮气躁，到最后只会一事无成；若你沉得住气，到最后便会百福自集。 听过这么一个故事。 曾经有两个从小就非常要好的意大利年轻人，他们是堂兄弟。 一个叫布鲁诺，一个叫柏波罗，他们都渴望成为村里最有钱的人。 有一天，村长把一份工作交给了他们，让他们负责把附近河里的水运到村里的蓄水池里。 他们觉得，这是一个千载难逢的机会，于是便辛勤地工作。 在第一天干完活后，村长按每桶1分钱的价格支付了他们的薪资。 布鲁诺兴奋地大声对别人说：“只要我每周提100桶水，就可以轻松赚1块钱了！半年后，我就能盖一间新房子。” 然而柏波罗却并不是这么想的，他说：“这样不是一个好办法，不如修一条管道，将水引进村里。” 他耐心地向布鲁诺解释他的想法，不过急于求成的布鲁诺却始终不认可。 最后柏波罗决定，即使只有自己，也要把这个计划实现。 于是，他将时间分成了两部分。 一边正常运水维持生计，一边利用空余时间建造他的管道。 那段时间，布鲁诺都在悠然自得地工作，而柏波罗只能夜以继日地忙碌着。 没过多久，赚到钱的布鲁诺便嘲笑柏波罗，并常常在他面前炫耀自己的财产。 但柏波罗没有理会，而是不断提醒自己，要坚持下去。 两年后，管道完工了，村民们看到水源源不断地流进来，都纷纷要求向柏波罗购买。 不久后，他就成为了村里最富有的人。 而布鲁诺因为管道的建立而失业了，日子过得十分拮据。 人生这趟旅途，就像一场马拉松。 短期爆发的人，或许夹杂着运气；但能撑到最后的人，拼的都是耐力。 而那些等待爆发的时刻，便是沉淀的过程。 沉得住气，是一种气度，也是一种力量。 学会沉住气、坚持努力，才能登高致远，赢得未来。 第三句：厚道之人，必有厚福。 人这辈子，最重要的，莫过于厚道做人、坦荡做事。 唯有这样，才能拥有好人缘，得到良好的信誉。 明清五百年间，晋商遍布天下，与潮商、徽商并为中国历史三大商帮。 其中晋商以乔致庸为代表，建立了实力最雄厚的商帮。 他获得成功的秘诀，就在于厚道做人，诚恳做事，坚持“信义利”的经营理念。 他认为，经商一定要以信誉为本，以义待人，信义为先，利取正途。 有一次，他发现油坊的伙计悄悄在胡麻油中掺假销售。 他立刻生气地严惩了掺假的伙计，并命人贴出“公告”： 凡是买到掺假胡麻油的客户都可以全额退款；剩下的掺假胡麻油将以绝低的价格卖给人们当灯油。 这样的举动，不仅重新树立了店铺的信誉和品牌，还获得了不少人的信任，深得民心。 看过这么一段话，很是在理： 人，以什么为本？以心为本。做人，以什么为本？以诚为本。做事，以什么为本？以做人为本。正所谓：做人需厚道，善念赢人生。 做一个厚道之人，生活的好运自然会降临到你的身上，人生也会处处充满阳光。","link":"/夜读20191023/"},{"title":"越难熬的时候，越要靠自己","text":"成年人的世界，单枪匹马的“战斗”，都是常态！人生在世，谁都希望，委屈了有人倾诉，难过了有人安慰，疲惫了有人送上肩膀，然而现实里，并不是每个人都有这样好的运气。 生活中，司空见惯的是，许多艰难无法言说，许多辛酸无人懂得，很多时候，只能靠自己坚持着熬过去。 说到底，成年人的世界，单枪匹马的“战斗”，都是常态。 记得有一次和朋友聊天，他说，“人生的路总是越走越孤独，虽然身边有数不清的朋友，可每个人都有自己的烦恼和困苦，大家都自顾不暇，你根本无法去依赖谁，终究只能独自去面对，学会将哭诉变成沉默，将眼泪藏在心底。” 一路走来，看到过不少人，年轻时遇到一点困难就哭天抢地，受到一点委屈就喧闹得人尽皆知。可后来，不管在多么难熬的时刻都保持沉默，不管内心有多孤独惶恐都笑着前行。 我想，前后转变的契机，不是因为变得成熟不爱说话了，而是经历过太多孤立无援的心酸和有苦难言的无奈，最后渐渐明白，不是所有的苦和累都有人分担，越是难熬的时候，越要靠自己。 不知道你是否和我一样，曾有过一段特别难捱的日子，仿佛在黑暗中摸索着前行，看不见阳光，也不知道未来的方向在哪里。想与谁倾诉，却发现不知道该用怎样的言语去描述自己内心的感受。于是千言万语挤在嘴边，最后只化作一句淡淡的“没什么”。 几年前我辞职经商，凭着创业的激情与奋进，生意有了一点起色。但因为一次决策欠缺考虑，多年积累的资金一夜间全部赔光。不愿告诉家人实情怕他们担心只能死扛，那时候口袋里只剩下150块钱，妻子打来电话说孩子要吃蛋糕，在蛋糕店徘徊许久，还是咬牙花50块钱买了一个小小的蛋糕带回家。 两岁的孩子一不小心，把蛋糕整个翻盘扣在地上。那一瞬间，我像头凶猛的野兽一样想要发火，看着我的样子，家人根本不理解，他们觉得为了一个小蛋糕至于吗？ 看着孩子惊恐的眼神，所有的脾气都化作一缕云烟，我陷入深深的自责。那一刻我发誓，一定要努力把失去的东西再赚回来。 我开始投递简历，在经历了不知多少次面试后，终于有一家公司录用了我，从此开始了朝九上班不知几点下班的生活。 过了几年，生活终于再次有了起色。曾经那些不能与人诉说的辛苦，经过了无数个日夜的洗礼，终究变成了让自己强大的资本。 如果说人生是一场苦海，那么身在其中的你我，都只能自渡。 没人理解的时候，要懂得自我开导，不是坐在原地无病呻吟；没人陪伴时，要学会自己去接受和承担，而不是在别人身上孤注一掷。 要知道，你不努力，没有人替你成长，你不勇敢，没有人替你坚强，在波折不断的路上，你只有靠自己的能力和胆量，踏过眼前的荆棘，才能收获明媚的未来。 其实，每个人都一样，路要自己一步步走，苦要自己一口口吃，没有人会感同身受你的一切，没有人会替你负重前行，越是难熬的时候，越要自我支撑。 生活，有光有影，有晴有雨，希望你拥有与之博弈的勇气，就算再苦再累，也能咬紧牙关，靠自己一步步走过去。 你会在某一天发现，穿越过黑暗看见的阳光，是如此炙热；经历过风雨见到的彩虹，是如此绚烂！","link":"/夜读20191024/"},{"title":"这就是沉默的力量","text":"苦而不言，喜而不语，是做人的最高境界！人生在世，谁都希望，委屈了有人倾诉，难过了有人安慰，疲惫了有人送上肩膀，然而现实里，并不是每个人都有这样好的运气。 生活中，司空见惯的是，许多艰难无法言说，许多辛酸无人懂得，很多时候，只能靠自己坚持着熬过去。 说到底，成年人的世界，单枪匹马的“战斗”，都是常态。 有人说，苦而不言，喜而不语，是做人的最高境界。仔细想想，确实很有道理。 因为苦而不言，是沉得住气，意味着撑得起艰难；喜而不语，是低得下头，意味着享得起喜乐。 始终相信，沉默是金。适时的沉默，能给人带来无穷的力量。 苦而不言，是沉淀。 朋友阿轩，最近很是郁闷，生活的重担压得他喘不过气，跟好朋友诉说一通后，还是感到烦恼、焦虑。 放假回家的时候，他跟爷爷一起坐在老屋里喝茶唠嗑。 在阿轩眼里，爷爷是个寡言的人，极少向他提及过往。 关于爷爷的往事，阿轩还是听奶奶讲的。 爷爷原本家境丰裕，过着衣食无忧的生活。 不料，后来家道中落，爷爷经历了财产散尽、无家可归、遭人冷眼等一连串的打击。 “爷爷，你当时不觉得苦吗？”阿轩问道。 “特别苦。” “但听奶奶说你那时候从没抱怨过苦。” 爷爷听后笑着指了指角落里的杯子，说：“你看那只杯子，长年累月地放在那里，每天都有灰尘飘下来，可水为什么依然清澄？” 阿轩也好奇，走近看了一下，说：“是不是因为灰尘基本都沉淀下去了？” 爷爷点了点头，继续说道： “一开始我也叫苦连天，但后来发现无济于事。那些烦心事就像灰尘，每天都会掉下来，一味地叫苦，就像不停地摇晃水杯，只会让水越来越浑浊，让人心烦意乱，甚至还会影响情绪和判断。 有些苦啊，就得自己熬。与其抱怨苦难，还不如老老实实想办法去突破苦难的包围。” 阿轩这时才明白，苦而不言，是不做无意义的抱怨，是不让痛苦变成脱缰的野马，肆意扫荡生活的每一个角落。 是让自己沉住气，在品味得失和甘苦中找到出路。也是因此，爷爷后来才得以重振家业。 能让自己有所沉淀、有所成长的经历，才能成为一个人的底气，也才对得起从艰难中一路熬过来的自己。 喜而不语，是低调。 喜而不语，是不炫耀、不张扬，是沉稳、谦虚。 有一个学生，一逮住机会就在别人面前炫耀自己。 有一天，他和老师在林荫小道上散步，老师停在一棵树下，问：“这棵树美吗？” 学生说：“枝头开了好多花，好美。” 这时，刚好一阵风起，老师接着问道：“你听见了什么？” “树叶被风吹得哗啦啦响的声音。” “树根会发出这样的声音吗？” 学生摇摇头，老师指着枝头，“在汉字中，树的枝头叫‘末’”，又指了指树底，“树根叫‘本’”。 看到学生一脸疑惑的表情，老师接着说：“对于一棵树来说，沉默的树根才是根本。” 一个人真正的修养，往往不在于他大肆宣扬的表面，而在于他低调的内心。 因为一点点成功就沾沾自喜的人，容易得意忘形，最终得不偿失。 低调，是一种令人敬佩的人格魅力。 低调的人，没有炫耀之心，没有张狂之态，遇到令人欣喜之事，也觉得无需四处张扬，只想铭记于心头，细细品味。 低调的人，举手投足间总是带着温暖的微笑，体验着生活里的小美好，无视那些多余的躁动。 低调的人，有着梅花暗香浮动般的魅力，有着兰花清幽出尘般的气质，相处起来，让人感到舒服和自在。 喜而不语，是才大而不气粗，居功而不自傲，富贵而不显露，华丽而不炫耀，这样的人，不必忧愁没有好人缘。 你的沉默，自有力量。 无论是恨不得将内心的欢喜昭告天下，或是把忧伤和盘托出，都显得天真稚气。 人生最难的是，懂沉默。 当无话可说的时候，适时的沉默比无谓的争辩来得更让人心悦诚服。 当有苦却无人懂的时候，适时的沉默比喋喋不休的抱怨更能让自己尽快脱离苦海。 当欣喜雀跃的时候，适时的沉默比沾沾自喜更能让自己虚心向学、不断进步。 懂得适时沉默的人，必定是一个内心强大的人。 岭上寂静，而花开遍野；山川幽静，而郁郁葱葱。 苦而不言的沉默，让人在隐忍中韬光养晦，积蓄力量，继而伺机走出阳光大道来。 喜而不语的沉默，让人在收敛中静品生活，进退有度，以温柔淡定的姿态面对一切。 这就是沉默的力量！","link":"/夜读20191025/"},{"title":"当你心累时，读读这3句话","text":"莫听穿林打叶声，何妨吟啸且徐行！我们这一生，有笑有泪、有得有失，体会过悲伤、品尝过痛苦、感受过忧愁。当然，也拥有过快乐、欣喜和幸福。 正所谓是：种种滋味，都是生活；好的坏的，皆为风景。 “人，活得再漂亮，也会有凄凉；路，走得再潇洒，也会有迷茫；歌，唱得再响亮，也会有冷场。” 余生，当你感觉累了，就读读这三句话。 身处暂时的低潮期时：“不要紧”。 生而为人，皆有向好之心，想站得更高一点、走得更远一点、活得更好一点。 但，不是所有的用心，都会被回应；不是所有的才华，都能被兑现。总有些时刻，我们发现自己力不从心、事不如愿。这，就是“瓶颈期”或者“低潮期”。 当“暗时光”来袭，有些人自责、自苦、自虐，对自己严加审判：“为什么别人可以，你却不行？” 有些人，会正视既定败局，从中求索经验、解剖规则，为杜绝坏事件的重演奠定基础，之后，轻轻对自己说：“不要紧。” 我们心疼前者，但要学习的，却是后者。因为他们不自戴枷锁，不自我折磨，能接纳自己、宽恕自己，这是非常棒的行事方式。 曾有一个理论说，人可以分成3个等级，“聪明人”占20%，“庸碌者”占20%，“平凡人”占60%。 由此可见，这世上还是普通人居多，大多数人生而平凡。所以，当遭遇了困难，那就别对自己太苛求。你要相信，总有海是无法横渡的，总有山是没人攀越的，总有沙漠是难于穿行的。 尽了力，目标还是没有完成；用了心，爱的人还是没有留住；费了劲，梦想还是擦肩而过……当这些发生时，千万不要让崩溃的情绪困住，一定要稳住心神，告诉自己：“不要紧，放轻松。” “不要紧”，不是事不关己高高挂起的逃避，而是一种智慧。 这种智慧是：先正视残局、接纳自己的平凡，然后解决自怨自艾的情绪，达到继续前行的目的。 遭到他人的伤害时：“没关系”。 人生在世，总有些伤害是避无可避的。 记得一部剧中有句台词是这样讲的，“凡是人总有取舍，你取了你认为重要的东西，舍弃了我，这只是你的选择而已，若是我因为没有被选择，就心生怨恨，那这世界岂不是有太多不可原谅之处？” 确实，这世间，除了父母至亲，没有人有义务一定要以我们为重、为先，我们与人交好，尽付真心是因为“甘愿”，如果对方能回报以同样的诚挚，这固然叫人欣喜，但如果没有，甚至还报以伤害，那也没什么可抱怨的。 只有轻轻道一句“没关系”，便是最好的解脱。 西方有谚语云：“怀着爱心吃菜，也要比怀着怨恨吃牛肉好得多。” 我们这一生，山一程、水一程地走过，能遇到的知交并不多，能令我们放下心防，赤诚以待的更少。 付出了巨大的勇气换来了两心相知，却要因为对方某一次的失误或者取舍，而要淡出一份情谊，这真是让人难过。 但是，除了放下和原谅，没有更好的疗愈途径。因为，旧伤、过去的记忆一旦永葆新鲜，那我们也将永远被怨愤挑逗。 “我恨你”，是杀敌八百，自损一千的自我惩罚，是以怨报怨的自寻烦恼；“没关系”，是情出自愿，爱过无悔的大度，是就此别过，唯望君安的宽悯。 弘一法师说：“人褊急，我受之以宽容；人险仄，我待之以坦荡。” 既然同好已失，故人已走，一切都回不到原点，那么，不妨选择释怀，让自己以赤子之心，感恩旧情。 对当下不满意时：“一切都会过去的”。 心理学上讲，人是唯一能接受暗示的动物。 生活中，我们总会对一些事情不满意，比如：不及格的分数、不对口的工作、未达标的KPI，等等。 当这些困扰我们时，除了奋起直追、奋勇自救，我们还应该对自己说：“加油，一切都会过去的。” 这种心理暗示，是心怀希望、心态乐观，能给人力量。苏轼就是这样的人。 在被贬的第三年，苏轼和朋友外出游玩，途中遇雨，但很快雨过天晴，他即兴赋诗：“莫听穿林打叶声，何妨吟啸且徐行；竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。” 这份旷达超然，助他度过了一生的坎坷。 被贬到黄州时，他耕田为业，打着牛角，和乡民一起唱和改编的诗词；被贬到惠州时，他帮农民改良生产用具，研究怎么才能减少疾病；被贬到海南时，他与民同乐，还兴办教育。 纵观苏轼的一生，他仕途坎坷，不是被贬，就是在被贬的路上，但精气神却一直都在。他始终相信，所有困顿都会过去的，一切苦厄都是暂时的。 所以，无论走到哪里，他都是吃吃美食、作作画、游游山、玩玩水，把生命中所有的孤单和黑暗，都兑换成了热气腾腾、声势浩荡，叫人敬佩又羡慕。 《时间是最好的良药》中有这样一段话： “很多时候，当下那个我们以为迈不过去的槛儿，一段时间之后，回过头看其实早就轻松跳过。当下那个我们以为撑不过去的时刻，其实忍着熬着也就自然而然地过去了。所有没能打败你的东西，都将使你变得更加强大。” 使我们变得强大的，是与万事万物的“和解”。 当我们身处低潮期，一句“不要紧”，是接纳自己，与平凡的自己和解； 当我们遭遇伤害时，一句“没关系”，是宽容朋友，与他人的过失和解； 当我们对现状不满，一句“一切都会过去的”，是满怀期望，与缺憾的生活和解。 余生，怎样的活法是最好的？是接纳自己、宽容他人、心怀期望，然后，不忘初心、砥砺前行。","link":"/夜读20191026/"},{"title":"后半生最好的活法","text":"活出属于自己的写意和潇洒！时光荏苒，岁月匆匆，不知不觉间，已行至人生的半坡。这一路上，人情冷暖，悲欢离合，皆已随着光阴消散。 数一数前半生，花开花谢看过了，山水迢迢走过了，大风大浪也经历过了。 忆当年，尝过甜头，也吃过苦头，爬过低谷，有过风光，但到头来依然迷茫。 有时候，你我如同沧海一粟，走得太远了，竟忘了为何而出发。 或许曾经的日子未尽如人意，但已无法回头。 往后的日子，愿你不要虚度，沉下心来，脚踏实地，活出属于自己的写意和潇洒。 后半生，活好自己。 有个小花匠出门担水，回来路上被狗给咬了。 回家之后呢，小花匠等老花匠帮他处理好伤口，拿起竹竿就往外跑。 老花匠见状，赶紧拦住他：“你的伤口还疼吗？” 小花匠摇摇头。 “既然不疼了，为何还要去打狗？” “因为它咬了我，我恨他！” 老花匠听了继续道：“狗咬疼了你，你就恨它；你伤害它，它也恨你。这样下去冤冤相报何时了呢？可你是人，何必与一只疯狗计较。” 小花匠不作声，默默低下了头。 老花匠又说：“这人啊，就像是种花，对待仇恨有三种做法： 第一种是记仇，任由仇恨的种子在心里生根发芽，到头来受伤的还是自己； 第二种是忘记仇恨，虽然将土壤翻新了，但依然会有栽种过的痕迹； 第三种是最高明的，就是主动和仇人和解，将花朵赠给对方，不仅解开了心结，还能留有芬芳。” 正如老花匠所说的，小到一草一木，大到做人做事，我们都应该少一些计较，多几分大度。 人生苦短，成熟的人，懂得时间珍贵，不与烂人烂事纠缠。 不管他人如何计较，把时间花在值得的人身上，活好自己便是了。 后半生，放过自己。 一位长者曾讲过这样的一个故事：有一个渔夫在沙滩上捡到了一颗硕大美丽的珍珠，但美中不足的是，那颗珍珠上有一个小小的斑点。 那渔夫本来没放在心上，但捕鱼时一直想着那个斑点，心不在焉。 于是，他便从兜里取出珍珠，试着把那个斑点慢慢剔除，这样，那颗珍珠就完美无瑕了。 当他狠心削去了珍珠的表层，斑点依然存在，他削去了一层又一层，一心想着把小斑点去掉。 就这样，他一整个下午没捕一条鱼，最后那个斑点没有了，而珍珠也不复存在了。 很多时候，我们都像这个渔夫一样，捡了芝麻却丢了西瓜，为了一点耿耿于怀的小事，错过了生命中更多美好的时刻。 人生不如意十有八九，但若我们只记得那些痛苦的部分，又怎能笑得开怀呢。 前半生我们不断拿起，后半生我们应该学会放下。 人生如海沉浮，就让所有的爱恨都随风而去，所有的往事落地成泥吧。 路走不通了，就学会转弯；人忘不掉了，就试着放手；事想不开了，就学会释怀。 拥有时，多一份珍惜和感恩；失去时，多一点坦然和淡定。 当我们放下包袱，沉淀过往，才能轻松启程，大步向前。 后半生，善待自己。 在这有限的生命里，我们不仅要善待他人，更要善待自己。 爱自己，是终身浪漫的开始，也是拥有幸福生活的前提。 前半生，忙忙碌碌，睡得太晚，想得太多，结果是落得满身疲惫。 这时才发现，自己把一切记在心里，却唯独忘了自身。 以往吃吃喝喝，觥筹交错，直到突然大病一场，才恍然醒悟：青春可以挥霍，身体却不可以。 人生的下半场，拼的是健康。 工作再忙，也别忘了多出去走走，强身健体；应酬再多，也别忘了最朴实的柴米油盐，一蔬一饭；加班再累，宁愿披星戴月，也不要通宵达旦。 很喜欢丰子恺说过的一句话： “心小了，所有的小事就大了；心大了，所有的大事都小了；看淡世事沧桑，内心安然无恙。” 世间本无事，庸人自扰之。 与其计较那些鸡毛蒜皮的小事，不如把时间花在更有意义的事情上。 生命是一个过程，内心丰盈的人，往往懂得富养自己。 拥有自己的爱好，看想看的书，去想去的地方，买喜欢的衣服……再平凡的生活，都能过出诗意。 后半生，感恩遇见。 人生本来就是一个做“减法”的过程，无论是父母，还是其他陪伴我们的人，相处的时间总是短暂。 在这有限的时光里，请珍惜爱你的人，收敛起脾气，打包起怨气，别把真心待你的人弄丢了。 生命来来往往，来日并不方长，前半生的亏欠，后半生记得弥补上。 感恩生命中的每一场遇见，珍惜陪伴左右的家人和朋友，在流淌的时光里回忆，在静默的相处中铭记。 往后余生，愿你不为难自己，不辜负岁月，在平凡的生活里，且行且珍惜。","link":"/夜读20191027/"},{"title":"人世间最可贵的是成全","text":"成全他人，就是成全自己！《论语》里有言：“君子成人之美，不成人之恶。小人反是。” 小人利己不利人，别人穷困，他就高兴；别人幸福，他就怨恨。而君子却愿意利人利己，真心实意地为别人的成功鼓掌，将自己的快乐施予他人。 人到中年，才知道，人世间最可贵的是成全，人世间最难做到的，也是成全。 成全，是一种善良。 火车就要开动了，一名乘客匆匆赶来。在上车时，他的一只脚被门夹了下，一只鞋掉在了车下。火车开动，只见那人没有抱怨，也没有犹豫，而是立刻把另一只鞋脱下来扔出窗外。其他乘客问他为什么这么做，他说：“如果一个穷人正好经过那里，他就可以得到一双鞋，而不是一只鞋。” 虽然这只是一个随手的举动，却能折射出“成全”的美德。当你得不到时，不如成全别人。你的成全里，包含着最珍贵的大度与最难得的善良。 然而，在生活中，能做到这一点的人却少之又少。有人看到闺蜜考上心仪大学，便将她的志愿偷偷改掉，害她落榜；有人看到同事升职加薪，便故意四处造谣，害他被领导猜忌。 亚里士多德曾说：“嫉妒者之所以痛苦，是因为折磨他的不仅仅是自己本身的失败和挫折，还有别人的成功。” 人世间最可怕的，不是得不到什么，而是自己得不到，也不想让别人得到。可是，就如同绿叶希望花朵枯萎，却不知花落过后就是叶的凋零；黑夜希望白昼逝去，却不知昼尽之后是新的轮序。那些被嫉妒缠绕的人，终将把自己圈定在一个无形的牢笼。他们不懂得，见不得别人好的人，自己永远都不会好。 人生在世，不如意之事十有八九，失去与得不到，更是家常便饭。那些会愿意在别人得到时祝福对方，在自己得不到时成全对方的人，才真正拥有骨子里的善良。 成全，是一种智慧。 古人云：“渡人先渡己，渡己亦渡人。”纵观古今能成大事者，都明白一个道理：人只有懂得成全别人，才能成全自己。 曾国藩在培养后生时，从来都是真心实意的。在军务最繁忙时，他还不忘组织考试，像老师一样为学生批改试卷，直到深夜。闲暇之时，他会找来学生谈天吃饭，将自己毕生所学倾囊相授。 曾国藩有个学生很有灵气，在他的培养下，这名学生羽翼渐丰。曾国藩非但不担心他会爬到自己头上，还将自己调教出来的湘军精锐调拨过去，作为“赠嫁之资”。 这名学生，便是被誉为“晚清第一人”的李鸿章。 如此的事例屡见不鲜。 人生在世，如能做到成全，便是一种善良；如果能遇到一个与你彼此成全的人，便是难得的运气。哪怕对方是你的竞争对手，拥有一位互相成全的“敌人”，你会感叹：原来，这世间还有一种关系，它超越了竞争、超越了友谊，它的名字，便叫成全。 成全，是最难得的情感。 钱学森和蒋英，则是一对互相成全的患难夫妻。为了成全钱学森的求学之旅，蒋英在新婚不久就陪伴丈夫漂洋过海，来到千里之外的异国他乡。一儿一女出生后，原本十指不沾阳春水的蒋英担负起了照顾孩子的重担，无怨无悔。为了成全钱学森的科研之梦，蒋英离开了她最爱的舞台，默默成为钱学森背后最坚强的后盾。 有位作家曾说：“若人与人实在需要保持一些距离，不如就成全彼此的光彩照人。” 原来，真正的爱情，便是甘愿为了成全对方而付出一切，名利、财产甚至于自己毕生的梦想。原来，美好的婚姻，便是相濡以沫，彼此成全。 人世间最可贵的是什么？也许在一千个人心中，会有一千个不同的答案。葛朗台会觉得最可贵的是财产，雨果则说最可贵的是善良。然而在我心里，人世间最可贵的，是成全。 成全，是一种善良。善良的人在自己得意时，不忘拉人一把；当自己得不到时，愿意成全别人得到。 成全，是一种智慧。径路窄处，留一步与人行；成全他人，就是成全自己。 成全，是最难得的情感。彼此成全，是感情长久的底气；互相成全的两个人，才是真的爱得深沉。 其实，世界就像是一面巨大的回音壁，你如何对待世界，世界就如何对待你。 当你给予别人鲜花，自己也满手留香。当你为别人喝彩，自己也能得到掌声。 往后余生，望你成为一个愿意成全别人的人。你此刻的成全，总有一天，会让你的人生之路越走越宽。","link":"/夜读20191028/"},{"title":"不委屈自己，不亏欠别人","text":"人生不求皆大欢喜，但求问心无愧！有些人五十岁后依旧活得年轻潇洒，有些人三十多岁就已经满脸老态。 仔细观察那些活得年轻的人，你会发现，他们无非做到了十个字：不委屈自己，不亏欠别人。 不委屈自己，才能活得轻松自在；不亏欠别人，才能活得踏实安稳。人生若能做到这两点，哪儿还有什么烦恼。 不委屈自己，是对人生最大的尊重。 小荟经营着一家淘宝店，生意一直不错，前几天却突然关闭了，问及原因，她苦笑着说，“我的店是被熟人吃垮的”。 原来中秋节的时候，她新进了一批月饼，就在朋友圈宣传了一下优惠活动。 这一宣传不得了，立马有亲戚打电话给她，“刚刚看到你朋友圈里发的月饼，看起来挺不错的，能送我一些吗？” 小荟有些犹豫，一方面这些月饼都不便宜，另一方面对方是自己的长辈，不太好拒绝。 于是她把进货的照片发给亲戚，说可以在进货价的基础上再便宜一些，或者买一送一。 可亲戚还是不愿意，“哎，一点小东西至于吗，你小时候我可是抱过你的，亏我对你那么好。” 小荟想了半天，也没想出来这位亲戚是谁，更别说亲戚口中的抱过自己了。 可是她耐不住亲戚的软磨硬泡，就送给亲戚了两盒400多的月饼，然后立马删除了刚刚的朋友圈，并要求亲戚保密。 本来这件事就该这样结束了，可万万没想到的是，亲戚“好心”地在朋友圈里夸奖了她一番：“表侄女小荟送的月饼，长大了，知道孝敬了，真不错。”还配了几张月饼的图片。 接下来，就是最让小荟头疼的事情了。 更多的亲戚朋友来找小荟，张口就是要月饼，有些会给一点钱，但大部分都没给钱。 如果小荟不给，亲戚们就是一番大道理，“你给人家不给我是不是看不起我呀”，“小时候我对你多好啊，没想到是个白眼狼”。再不行，就找小荟的父母要。 最后没办法，小荟在朋友圈宣布由于经营不善，关闭了淘宝店。 即便是这样还是堵不住亲戚朋友的嘴，“不想给就不想给，不就几百块钱的东西嘛，真小气。” 小荟委屈得不得了，感叹好人难做，出钱不讨好。 这个世界上，有一种人最累，那就是不懂得拒绝别人，只会委屈自己的人。 愿意为他人付出，是一种善良，但是这种善良要有度，如果把握不好这个度，生活就会很累。 不愿意做的事情，不要勉强自己。不愿意处的关系，趁早断开联系。不愿意待的环境，及时抽身而退。 余生，愿你做个不卑不亢的人，无需刻意迎合谁，无需刻意将就谁。 在自己的角落里散发着自己的光亮，在自己的朋友圈里和舒服的人相处，做自己喜欢的事情。 学会珍爱自我，关照自己的感受，这样才能活出幸福的模样。 不亏欠别人，是对人格最好的答卷。 若问什么人活得最踏实？自然是不亏欠别人，无心无愧的人。 孟子说：“仰不愧于天，俯不怍于地。”为人处世不能愧对天地，愧对自己的良心，做人必须光明磊落，问心无愧。 父亲有一位朋友是公司的老总，外出有司机，出差有招待。 有一次吃饭，父亲和母亲说，老总的父亲动手术，要借20000元。 母亲一脸怀疑的说：他可是老总啊，我就不信没有这人脉，父亲的手术费都没有。 父亲笑了笑：这就是他能安稳坐在老总这个位置的原因。不是没人给老总送过钱，但他都义正言辞地拒绝了。 俗话说：吃人嘴软，拿人手短。 若是亏欠了别人，偿还的可能是让你格外为难的事。 做人，干干净净就好。不亏待每一份热情，也不讨好每一份冷漠。不辜负所有的遇见，也不遗憾所有的离开。 不耽误任何人，不消耗任何人，不浪费任何人，这是一种善良。 人生不求皆大欢喜，但求问心无愧。 年纪越大，越相信，人的一生，心态才是最重要的，你的心态，就是你的命运。 你不亏欠别人，便能不受外物打扰；你不委屈自己，才能护自己余生安好。 所以，对于往事，我们要感恩遇见，不谈亏欠；对于当下，我们要放平心态，珍爱自我；对于未来，我们要心怀憧憬，放飞梦想。 愿你有不委屈自己的清醒，尽兴生活，自在随心，让每一个笑容都发自内心，让每一个清晨都充满阳光。 愿你有不亏欠别人的淡然，勇敢善良，光明磊落，活成自己想要的模样，也能驱散身边的悲伤。","link":"/夜读20191029/"},{"title":"熬过去，你就赢了","text":"光鲜亮丽的背后都是带着血和泪的伤痕！这世上，大多数人的工作都是又苦又累的，如果不上班也能拥有持续性的经济收入，我想99%的人都会选择把工作辞了。 可生活不是想象，比你过得苦，比你过得累的人太多了，无论是大城市还是小镇农村，24小时都有为生活奔波的人。 有人凌晨1点刚刚加班回到家，有人凌晨3点就已经起床准备工作，有人生病还坚守岗位，有人为了一个项目一天飞好几座城市。 谁都委屈，谁都在忍着、熬着、撑着。 之前，有一个关注度很高的辩题：“一份高薪不喜欢的工作和低薪很喜欢的工作，你会选择哪个?” 其实这道题永远没有正确答案，一个可怜的现实是，选择高薪不喜欢的工作，就基本上把你所有的时间都贩卖给了公司，你还得拼命强忍着内心对它的排斥。 而选择了低薪很喜欢的工作，也许一开始你本以为这份工作可以让你快乐无比，可生活的各种磨难都会因为钱的不够用而接踵而至。 无论是哪一边的选择，都不容易。 有人说，不可以选择高薪又喜欢的工作么？ 谈何容易。 没有绝对的实力，哪个公司愿意给你高薪，而当你把一个工作重复过百次千次之后，又有多少人仍旧保有最初的喜欢和热情。 作家刘震云说过一句话： 世上所有的东西都可以挑，就是日子不能挑。世上所有的事情都经不起推敲，一推敲，每一件都藏着委屈。 前几天，朋友打电话给我：“我不想工作了，真的快撑不下去了，为什么付出那么多努力，可回报就那么少呢？为什么无论我怎么做都达不到心目中的理想值呢？” 这段话，或许在绝大部分人的心里都出现过。 有时候不是说怕苦怕累，而是觉得付出和收获已经失衡，是很想出人头地，很想做孙悟空一样的超级英雄，可现实告诉你，你也许只是万千普通人中的一分子。 这世上，没有哪一种成就是可以轻易获得的。 我们羡慕别人年少成名，却没看到他们从我们还在玩耍的年纪就已经练习过几十万次，摔过、哭过、痛过、放弃过、也振作过。 我们羡慕别人事业顺利，却没看到他们背后的焦灼和操劳，他们可以为了一个难题找遍上百种解决方法，寻遍各种人脉，也可以为了准备一个项目连续三天三夜地加班。 羡慕别人自己当老板，收入高，可他们工作的苦，不是每个人都可以承受的。有些人可以承受身体的累，却承受不了巨大的心理压力。 羡慕别人进了大公司，平台大福利好，可跨入那道门槛的背后，又有多少人知道他们为学业、为面试准备了多久？ 光鲜亮丽的背后都是带着血和泪的伤痕。没有一份工作不辛苦，就像没有哪一种人生轻易就可以过得好。 有句话说得好：不要去羡慕别人的一路坦途，你看不到别人起步时的苦难，别人拥有的，你羡慕不来；自己的生活，好坏都得过。 心态再失衡，都要学会自我调节；工作再不爽，都得我们自己承受。 经常能收到读者的一些留言，有些是吐槽，有些是感慨，有些是用自己的亲身经历给他人做出的提醒。 最让我感动的是这样一条留言： 两年前，我的母亲重病，我工资不高，家里条件也很一般，拿不出钱给母亲买那些进口药，那段时间是我最崩溃的时候，找遍了亲朋借钱，可还是不够，钱不够，时间也不够。 从那以后，我就知道，有些委屈必须得忍，没钱没实力，拿什么保护家人，他们需要你的时候，你只能可怜地束手无策，说句我没办法。 也是从去年开始，我的工资开始从一个月2000上升到一个月15000，从职员做到了部门经理，大家都羡慕我。 可我自从母亲走后，就没睡过一个好觉。我不想再拥有一次自己无能为力的机会。 人为什么要努力工作？ 一为自己，尽早把能力提升上来，才会有其他后路，尽快让工作出成果，经济自由才不会只是空想。 二为家人，把自己的实力变强，才能把保护家人这个事情落到实处，也才能有底气抵御未知的风险。 三为生命有所意义，工作是最能考验耐力、创造力、思辨能力的事情，它也是我们实现自我价值的平台，没有尝试过努力工作的滋味，人生会少一大半乐趣。 正如那句话：没事少矫情，有空还是多读书、多挣钱吧。 很喜欢普希金写的一首诗： 假如生活欺骗了你，不要忧郁，也不要愤慨！不顺心的时候暂且容忍：相信吧，快乐的日子就会到来。我们的心永远向前憧憬，尽管生活在阴沉的现在：一切都是暂时的，转瞬即逝，而那逝去的将变为可爱。 假如工作欺骗了你，让你受了累，受了委屈，不要一蹶不振，也不要放弃自己，把心沉下来，踏踏实实地去提升自己的能力，武装自己的本事，你才有资格去要求更多的东西。 这个社会很现实，一个人，有了价值，才有了说话的权利。 而在此之前，该忍耐的还是得忍耐，该拼搏的还是不能停步，关关难过关关过，夜夜难熬夜夜熬。 熬过去，你就赢了！","link":"/夜读20191030/"},{"title":"活在当下，给自己找到一个恰到好处的位置","text":"有一部电影叫《遗愿清单》，讲了一个身价千万的富人和普通的汽车维修工同时患上了癌症，住进了一家医院，他们俩在病床上等待着即将来临的死亡，临终前回忆自己的一生真的过得快乐吗？ 富人一辈子为事业打拼，离过几次婚，不缺女人，尽管有钱但也没有真正的朋友和亲人，所以感到内心空虚，穷人一辈子抚养三个孩子，为了孩子放弃了很多自己喜欢的东西，省吃俭用把自己的一生奉献给了家庭，而自己还有很多遗憾。他们两个身份地位截然不同，但是在死亡面前却是平等的。 于是二人决定在人生最后的6个月里列下遗愿清单，为自己活一次，去做这一辈子觉得遗憾的事。 他们去高空跳伞，去飙车，去万里长城，去埃及金字塔，去埃塞俄比亚看野生动物，去喜马拉雅山目睹神迹，去出于善意帮助陌生人，去亲吻世界上最美的女孩，一段看世界的游历过后他们把最后的时光留给了家人。 他们收获了整个世界，最重要的事在人生最后的阶段，拥有了一段真挚无比的友情。 去世后他们二人的骨灰装在了最爱的咖啡罐头里，埋在了喜马拉雅山上。 电影带有浪漫的戏剧色彩，但也给我们的生活带来一些思考，人的生命有限，要在有限的生命里尽可能的去充实自己，去做自己喜欢的事，我们没有办法决定人生的长短，但至少可以决定人生厚度。 无论贫穷还是富贵，走到人生边上的时候，才发现人生被太多物质的外在的事物捆绑，而真正让自己快乐的是为自己活一次，我们甚至不知道明天和死亡哪一个先来，活在当下，做自己想做的事，去经历这段人生后所收获的爱情、友情、亲情。 我时常会想到人生，想到死亡。 在苍茫的宇宙里，如果有一双眼睛要怎样才能找到我，比一粒尘埃还要细微，即便是珠穆朗玛峰乃至整个地球，在银河系在星系团中也是沧海一粟。人类的微不足道常常让我产生一种虚无感，感觉活着做的一切都没有意义。 放大了尺度来看，生活即使虚无的，每个人都在命运的摆布下无力的生活着。恰恰因为如此，我们就应该活在当下，因为我们只存在于当下，人生是由无数个当下组成的，人应当在短暂的生命力找到自己恰到好处的位置。 我喜欢的作家张晓风在她新书《回首风烟》里阐述了她对自然的存在，生命的存在、时间的存在的哲学思辨，她写道：树在，山在，大地在，岁月在，我在。你还想要怎样更好的世界。她在书中用暖心的笔墨描绘她一生中的见闻和感悟，用人生大半辈子的经历告诫我们处事的智慧和乐观的生活态度。热爱当下的生活，享受当下的人生。 宇宙是浩瀚的，人生是虚无的。那我们生活的意义就在于，在当下有花草树木，有山水江河，有时间流淌，有爱人，有自己，尽管随着时间流转这些将会消逝，但至少当下这些是难得可贵的，是美好的。 把握住当下，活在现在，找准自己的位置，去行动，去感受自然，去珍惜身边可贵的人们，生命才会变得更加充实，自在。 有个故事这样讲道：有个小和尚，每天早上负责清扫寺院里的落叶。 清晨起床扫落叶实在是一件苦差事，尤其在秋冬之际，每一次起风时，树叶总随风飞舞。每天早上都需要花费许多时间才能清扫完树叶，这让小和尚头痛不已。他一直想要找个好办法让自己轻松些。 后来有个和尚跟他说：“你在明天打扫之前先用力摇树，把落叶统统摇下来，后天就可以不用扫落叶了。”小和尚觉得这是个好办法，于是隔天他起了个大早，使劲地猛摇树，这样他就可以把今天跟明天的落叶一次扫干净了。一整天小和尚都非常开心。 第二天，小和尚到院子里一看，他不禁傻眼了。院子里如往日一样满地落叶。 老和尚走了过来，对小和尚说：“傻孩子，无论你今天怎么用力，明天的落叶还是会飘下来。” 小和尚终于明白了，世上有很多事是无法提前的，不管人们怎么为未来担忧，也无法避免未来的可能性，惟有认真地活在当下，做好今天的每一件事，未来的交给未来的自己，才是最真实的人生态度。 克里希拉姆提说过：“所谓活在当下，就是在刹那间领会其中的美与喜悦，而不眷恋它所带来的快感。” 就像我们去看绘画展览，很多人路过一个景点就赶紧拿出手机拍照，希望留作纪念，想着能够给未来的自己看，而却忽视了这幅作品在你面前的那一刻给你带来的震撼和思考。 世界上有很多美转瞬即逝，有很多人匆匆路过就再也遇不见，所以我们要找准自己的位置，不要多虑未知之事，不要去奢望不能之事。做好当下的事，不要去等，去尽可能的去做想做之事。 因为当这个世界把自己呈现在我们面前的那一刻，我们可以喊出：我在！","link":"/美文20191006-01/"},{"title":"向美好的方向走，总有一天会遇见美好","text":"向着秋季的深处走去，夜晚的风凉快了许多。城市依旧车来人往的忙碌，很久没有抬头看月亮，低头走路久了，竟然忘记了许多美好的事物。 路上的车流排成一道风景，车灯点亮城市的夜空，在城市里即便是独处，身体也是不寂寞的，而让我们感觉孤独的是自己的内心。循着生命之路，走下去，也许这个秋天只是一段时光。 好多人总说“余生还长，无需慌张”，不尽然，一生真的不长，就在日月的交替里，我们不知不觉就从年少走到老去。弹指一挥间，往事皆如烟。 只有认真的感受此刻自己的生活，才不辜负时间的好。 年少不识愁滋味，为赋新诗强说愁。而今年华渐老，几多忧愁却难于开口。也只能安慰自己说，越来越成熟。其实所谓的成熟是我们不得不去深沉地对待生活。如果能有命运的厚爱，我们还是乐于一直做少年时那种无忧无虑的纯真。 在生活的行板上，遇见风和日丽，遭遇惊涛骇浪，不能停止的行程里，就连笑容也逐渐坚硬起来。每一位老者的表情都是肃穆而和蔼的，因为他们看过了人间的繁华和凄凉，懂得了敬畏和包容。 于是，在老去时又回归了孩童的童真，放下了一切身心的包袱。生命是一场轮回，从出生时的无知无识而纯粹，到老去时的看透和放下而活得纯粹。生命是神秘的，没有两个相同命运的人，它时时刻刻发生着变化，一步一步走下去，错过的风景再也回不到过去，所以心怀敬畏，珍惜当下。 时光里的美好，无处不在。路边开着的小野花，手中翻阅的书香，天上的月亮，河流在唱歌，小动物们那么可爱，晚风拂来清爽宜人，这一切的美好，都是对生命最厚实的赠予。你若不善待美好，那么美好将离你而去。 人在最努力的时候最好运，心存敬畏，在生命的历程中，认真坚持，才能成就更好的自己。当时对于写作的坚持源于作家林清玄的一番话，那天坐在一辆出租车上，收音机里的他很诚恳地说：“自己每天坚持写三千字，对他来说，已经是一种习惯了。”于是我尝试着每天坚持写一千字，日积月累在我写作的时候忽然发现很多时候写作不再枯涩，而是一种习惯。只要足够用力，生命的长度就会增加。 生活不是一床温软的被子，永远温暖踏实。它也有带给我们伤痛的时候，我们用心爱过的人，都成了彼此的亲人，彼此成了彼此的肌肉，骨头，血液，在分别的时候，痛彻心扉。太多我们不能掌控的事情在发生，无能为力中，只有心痛难忍。 时光是一个万花筒，转呀转就画出一幅美丽的画面，而生活的真相里，是残酷的现实。对待时光里发生的所有，始终保持热情。多向美好的方向走，总有一天我们会遇见美好。 秋夜的风吹来，每一盏灯火下都有自己的故事。我们不能替代别人的生活，别人也不能和自己感同身受。唯有在真实的生活里，认真地去对待，用最真的心去对待身边的人和这个世界。 始终保持敬畏之心，对时光，对美，对痛楚，永远去爱。","link":"/美文20191007-01/"},{"title":"JS面试中常见的算法题","text":"js除了基础知识以外，算法也是挺重要的。因此特意整理了一些常见的算法题，希望大家有帮助！ 1、验证一个数是否是素数 如果这个数是 2 或 3，一定是素数； 如果是偶数，一定不是素数； 如果这个数不能被3~它的平方根中的任一数整除，m必定是素数。而且除数可以每次递增（排除偶数）。 function isPrime(num){ if (num === 2 || num === 3) { return true; }; if (num % 2 === 0) { return false; }; let divisor = 3,limit = Math.sqrt(num); while(limit &gt;= divisor){ if (num % divisor === 0) { return false; } else { divisor += 2; } } return true;}console.log(isPrime(30)); // false 2、斐波那契 最简单的做法：递归。 function fibonacci(n){ if (n &lt;= 0) { return 0; } if (n == 0) { return 1; } return fibonacci(n-1) + fibonacci(n-2);} 但是递归会有严重的效率问题。比如想要求得f(10)，首先需要求f(9)和f(8)。同样，想求f(9)，首先需要f(8)和f(7)…这样就有很多重复值，计算量也很大。 改进：从下往上计算，首先根据f(0)和f(1)计算出f(2)，再根据f(1)和f(2)计算出f(3)……以此类推就可以计算出第n项。时间复杂度O(n)。 function fibonacci(n){ let ori = [0,1]; if (n &lt; 2) { return ori[n]; }; let fiboOne = 1,fiboTwo = 0,fiboSum = 0; for (let i = 2; i &lt;= n; i++) { fiboSum = fiboOne + fiboTwo; fiboTwo = fiboOne; fiboOne = fiboSum; } return fiboSum;}console.log(fibonacci(5)); 3、求最大公约数 除数 在a和b的范围内，如果同时a和b处以除数的余等于0，就将此时的除数赋值给res；除数自增，不断循环上面的计算，更新res。 function greatestCommonDivisor(a, b){ let divisor = 2,res = 1; if (a &lt; 2 || b &lt; 2) { return 1; }; while(a &gt;= divisor &amp;&amp; b &gt;= divisor){ if (a%divisor === 0 &amp;&amp; b%divisor === 0) { res = divisor; } divisor++; } return res;};console.log(greatestCommonDivisor(8, 4)); // 4console.log(greatestCommonDivisor(69, 169)); // 1 解法2 function greatestCommonDivisor(a,b){ if (b === 0) { return a; } else { return greatestCommonDivisor(b,a%b); }}; 4、数组去重 对原数组进行遍历获取arr[i]的值 j；对应到辅助数组 exits 的位置 j 的值，如果没有，则证明arr[i] 的值没有重复，此时将 值j 存入res数组，并将辅助数组 j 位置的值置为true。最后返回res数组。 function removeDuplicate(arr){ if (arr === null || arr.length &lt; 2) { return arr; }; let res = [],exits = []; for(let i = 0; i &lt; arr.length; i++){ let j = arr[i]; while( !exits[j] ){ res.push(arr[i]); exits[j] = true; } } return res;}console.log(removeDuplicate([1,3,3,3,1,5,6,7,8,1])) // [1,3,5,6,7,8] 5、删除重复的字符 这一题的解法和上一题类似。 function removeDuplicateChar(str){ if (!str || str.length &lt; 2 || typeof str != \"string\") { return; }; let charArr = [],res = []; for(let i = 0; i &lt; str.length; i++){ let c = str[i]; if(charArr[c]){ charArr[c]++; } else{ charArr[c] = 1; } } for(let j in charArr){ if (charArr[j] === 1) { res.push(j); } } return res.join(\"\");}console.log(removeDuplicateChar(\"Learn more javascript dude\")); 6、排序两个已经排好序的数组 如果 b数组已经遍历完，a数组还有值 或 a[i] 的值 小于等于 b[i] 的值，则将 a[i] 添加进数组res，并 i++；如果不是上面的情况，则将 b[i] 添加进数组res，并 i++； function mergeSortedArr(a,b){ if (!a || !b) { return; }; let aEle = a[0],bEle = b[0],i = 1,j = 1,res = []; while(aEle || bEle){ if ((aEle &amp;&amp; !bEle) || aEle &lt;= bEle) { res.push(aEle); aEle = a[i++]; } else{ res.push(bEle); bEle = b[j++]; } } return res;}console.log(mergeSortedArr([2,5,6,9], [1,2,3,29])) // [1,2,2,3,5,6,9,29] 7、字符串反向 function reverse(str){ let resStr = \"\"; for(let i = str.length-1; i &gt;= 0; i--){ resStr += str[i]; } return resStr;}console.log(reverse(\"ABCDEFG\"));function reverse2(str){ if (!str || str.length &lt; 2 || typeof str != \"string\") { return str; }; let res = []; for(let i = str.length-1; i &gt;= 0; i--){ res.push(str[i]); } return res.join(\"\");}console.log(reverse2(\"Hello\")); 将函数添加到String.prototype String.prototype.reverse3 = function(){ if (!this || this.length &lt; 2) { return; }; let res = []; for(let i = this.length-1; i &gt;= 0; i--){ res.push(this[i]); } return res.join(\"\");}console.log(\"abcdefg\".reverse3()); 8、字符串原位反转 例如：将“I am the good boy”反转变为 “I ma eht doog yob”。 提示：使用数组和字符串方法。 function reverseInPlace(str){ return str.split(' ').reverse().join(' ').split('').reverse().join('');}console.log(reverseInPlace('I am the good boy')); 9、判断是否是回文 function isPalindrome(str){ if (!str || str.length &lt; 2) { return; } for(let i = 0; i &lt; str.length/2; i++){ if (str[i] !== str[str.length-1-i]) { return false; } } return true;}console.log(isPalindrome(\"madama\")) 10、判断数组中是否有两数之和 eg：在一个未排序的数组中找出是否有任意两数之和等于给定的数。 给出一个数组[6,4,3,2,1,7]和一个数9，判断数组里是否有任意两数之和为9。 eg：在一个未排序的数组中找出是否有任意两数之和等于给定的数。 给出一个数组[6,4,3,2,1,7]和一个数9，判断数组里是否有任意两数之和为9。 function sumFind(arr,num){ if (!arr || arr.length &lt; 2) { return; }; let differ = {}; for(let i = 0; i &lt; arr.length; i++){ let subStract = num - arr[i]; if (differ[subStract]) { return true; } else{ differ[arr[i]] = true; } } return false;}console.log(sumFind([6,4,3,2,1,7], 9)); // true 11、连字符转成驼峰 如：get-element-by-id 转为 getElementById let str = 'get-element-by-id';let arr = str.split('-');for(let i=1; i&lt;arr.length; i++){ arr[i] = arr[i].charAt(0).toUpperCase() + arr[i].substring(1);}console.log(arr.join('')); // getElementById 12、加油站问题-贪心算法 一辆汽车加满油后可行驶n公里。旅途中有若干个加油站。设计一个有效算法，指出应在哪些加油站停靠加油，使沿途加油次数最少。对于给定的n(n &lt;= 5000)和k(k &lt;= 1000)个加油站位置，编程计算最少加油次数。并证明算法能产生一个最优解。 要求： 输入：第一行有2个正整数n和k，表示汽车加满油后可行驶n公里，且旅途中有k个加油站。接下来的1 行中，有k+1 个整数，表示第k个加油站与第k-1 个加油站之间的距离。第0 个加油站表示出发地，汽车已加满油。第k+1 个加油站表示目的地。 输出：输出编程计算出的最少加油次数。如果无法到达目的地，则输出”NoSolution”。 function greedy(n, k, arr){ // n:加满可以行驶的公里数; k:加油站数量; arr:每个加油站之间的距离数组 if (n == 0 || k == 0 || arr.length == 0 || arr[0] &gt; n) { return \"No Solution!\"; // arr[0] &gt; n ：如果第一个加油站距离太远，也无法到达 }; let res = 0, distance = 0; // res：加油次数；distance：已行驶距离 for(let i = 0; i &lt;= k; i++){ distance += arr[i]; if (distance &gt; n) { // 已行驶距离 &gt; 加满可以行驶的公里数 if(arr[i] &gt; n){ // 如果目前加油站和前一个加油站的距离 &gt; 加满可以行驶的公里数，则无法到达 return \"No Solution!\"; }; // 可以在上一个加油站加油，行驶到目前的加油站i： distance = arr[i]; res++; // 加油次数+1 } } return res;}let arr = [1,2,3,4,5,1,6,6];console.log(greedy(7,7,arr)) // 4 13、用正则实现trim() 清除字符串两端空格 String.prototype.trim1 = function(){ // return this.replace(/\\s*/g,\"\"); // 清除所有空格 return this.replace(/(^\\s*)|(\\s*$)/g,\"\"); // 清除字符串前后的空格};console.log(\" hello word \".trim1()) // \"hello word\" 14、将数字12345678转化成RMB形式：12,345,678 思路：将字符串切割成数组再反转，遍历数组，加入辅助数组，当数组长度为3的倍数，再向辅助数组加入 “,”。 function RMB(str){ let arr = str.split(\"\").reverse(); let res = []; for(let i = 0; i &lt; arr.length; i++){ res.push(arr[i]); if ((i + 1) % 3 === 0) { res.push(\",\"); } } return res.reverse().join(\"\");}console.log(RMB(\"12345678\")) 15、删除相邻相同的字符串 function delSrt(str){ let res = [], nowStr; for(let i = 0; i &lt; str.length; i ++){ if (str.charAt(i) != nowStr) { res.push(str.charAt(i)); nowStr = str.charAt(i); } } return res.join(\"\");}console.log(delSrt(\"aabcc11\"))","link":"/JS面试中常见的算法题/"},{"title":"JavaScript手写代码无敌秘籍","text":"中高级前端面试之手写代码 实现一个new操作符 实现一个JSON.stringify 实现一个JSON.parse 实现一个call或 apply 实现一个Function.bind 实现一个继承 实现一个JS函数柯里化 手写一个Promise(中高级必考) 手写防抖(Debouncing)和节流(Throttling) 手写一个JS深拷贝 实现一个instanceOf 1. 实现一个 new 操作符 new 操作符做了这些事： 它创建了一个全新的对象。 它会被执行 [[Prototype]]（也就是 __proto__）链接。 它使 this 指向新创建的对象。 通过 new 创建的每个对象将最终被 [[Prototype]] 链接到这个函数的 prototype 对象上。 如果函数没有返回对象类型 Object (包含 Functoin, Array, Date, RegExg, Error )，那么 new 表达式中的函数调用将返回该对象引用。 function New(func) { var res = {}; if (func.prototype !== null) { res.__proto__ = func.prototype; } var ret = func.apply(res, Array.prototype.slice.call(arguments, 1)); if ((typeof ret === \"object\" || typeof ret === \"function\") &amp;&amp; ret !== null) { return ret; } return res;}var obj = New(A, 1, 2);// equals tovar obj = new A(1, 2); 2. 实现一个 JSON.stringify JSON.stringify(value[, replacer [, space]]) Boolean | Number| String 类型会自动转换成对应的原始值。 undefined、任意函数以及 symbol，会被忽略（出现在非数组对象的属性值中时），或者被转换成 null（出现在数组中时）。 不可枚举的属性会被忽略 如果一个对象的属性值通过某种间接的方式指回该对象本身，即循环引用，属性也会被忽略。 function jsonStringify(obj) { let type = typeof obj; if (type !== \"object\") { if (/string|undefined|function/.test(type)) { obj = '\"' + obj + '\"'; } return String(obj); } else { let json = [] let arr = Array.isArray(obj) for (let k in obj) { let v = obj[k]; let type = typeof v; if (/string|undefined|function/.test(type)) { v = '\"' + v + '\"'; } else if (type === \"object\") { v = jsonStringify(v); } json.push((arr ? \"\" : '\"' + k + '\":') + String(v)); } return (arr ? \"[\" : \"{\") + String(json) + (arr ? \"]\" : \"}\") }}jsonStringify({x : 5}) // \"{\"x\":5}\"jsonStringify([1, \"false\", false]) // \"[1,\"false\",false]\"jsonStringify({b: undefined}) // \"{\"b\":\"undefined\"}\" 3. 实现一个 JSON.parse JSON.parse(text[, reviver]) 用来解析JSON字符串，构造由字符串描述的JavaScript值或对象。提供可选的reviver函数用以在返回之前对所得到的对象执行变换(操作)。 3.1 第一种：直接调用 evalfunction jsonParse(opt) { return eval('(' + opt + ')');}jsonParse(jsonStringify({x : 5}))// Object { x: 5}jsonParse(jsonStringify([1, \"false\", false]))// [1, \"false\", falsr]jsonParse(jsonStringify({b: undefined}))// Object { b: \"undefined\"} 避免在不必要的情况下使用 eval，eval() 是一个危险的函数， 他执行的代码拥有着执行者的权利。如果你用 eval()运行的字符串代码被恶意方（不怀好意的人）操控修改，您最终可能会在您的网页/扩展程序的权限下，在用户计算机上运行恶意代码。 它会执行JS代码，有XSS漏洞。 如果你只想记这个方法，就得对参数json做校验。var rx_one = /^[\\],:{}\\s]*$/;var rx_two = /\\\\(?:[\"\\\\\\/bfnrt]|u[0-9a-fA-F]{4})/g;var rx_three = /\"[^\"\\\\\\n\\r]*\"|true|false|null|-?\\d+(?:\\.\\d*)?(?:[eE][+\\-]?\\d+)?/g;var rx_four = /(?:^|:|,)(?:\\s*\\[)+/g;if ( rx_one.test( json .replace(rx_two, \"@\") .replace(rx_three, \"]\") .replace(rx_four, \"\") )) { var obj = eval(\"(\" +json + \")\");} 3.2 第二种：Function核心：Function 与 eval 有相同的字符串参数特性。 var func = new Function(arg1, arg2, ..., functionBody); 在转换JSON的实际应用中，只需要这么做。 var jsonStr = '{ \"age\": 20, \"name\": \"jack\" }'var json = (new Function('return ' + jsonStr))(); eval 与 Function 都有着动态编译js代码的作用，但是在实际的编程中并不推荐使用。 4. 实现一个 call 或 apply call 语法： fun.call(thisArg, arg1, arg2, …)，调用一个函数, 其具有一个指定的this值和分别地提供的参数(参数的列表)。 apply 语法： func.apply(thisArg, [argsArray])，调用一个函数，以及作为一个数组（或类似数组对象）提供的参数。 4.1 Function.call 按套路实现call核心： 将函数设为对象的属性 执行&amp;删除这个函数 指定this到函数并传入给定参数执行函数 如果不传入参数，默认指向为 window 4.1.1 简单版var foo = { value: 1, bar: function() { console.log(this.value) }}foo.bar() // 1 4.1.2 完善版Function.prototype.call2 = function(content = window) { content.fn = this; let args = [...arguments].slice(1); let result = content.fn(...args); delete content.fn; return result;}let foo = { value: 1}function bar(name, age) { console.log(name) console.log(age) console.log(this.value);}bar.call2(foo, 'black', '18') // black 18 1 4.2 Function.apply 的模拟实现apply() 的实现和 call() 类似，只是参数形式不同。Function.prototype.apply2 = function(context = window) { context.fn = this let result; // 判断是否有第二个参数 if(arguments[1]) { result = context.fn(...arguments[1]) } else { result = context.fn() } delete context.fn return result} 5. 实现一个 Function.bind() bind() 方法: 会创建一个新函数。当这个新函数被调用时，bind() 的第一个参数将作为它运行时的 this，之后的一序列参数将会在传递的实参前传入作为它的参数。(来自于 MDN ) 此外，bind 实现需要考虑实例化后对原型链的影响。 Function.prototype.bind2 = function(content) { if(typeof this != \"function\") { throw Error(\"not a function\") } // 若没问参数类型则从这开始写 let fn = this; let args = [...arguments].slice(1); let resFn = function() { return fn.apply(this instanceof resFn ? this : content,args.concat(...arguments) ) } function tmp() {} tmp.prototype = this.prototype; resFn.prototype = new tmp(); return resFn;} 6. 实现一个继承 寄生组合式继承 一般只建议写这种，因为其它方式的继承会在一次实例中调用两次父类的构造函数或有其它缺点。 核心实现是：用一个 *F 空的构造函数去取代执行了 Parent* 这个构造函数。 function Parent(name) { this.name = name;}Parent.prototype.sayName = function() { console.log('parent name:', this.name);}function Child(name, parentName) { Parent.call(this, parentName); this.name = name; }function create(proto) { function F(){} F.prototype = proto; return new F();}Child.prototype = create(Parent.prototype);Child.prototype.sayName = function() { console.log('child name:', this.name);}Child.prototype.constructor = Child;var parent = new Parent('father');parent.sayName(); // parent name: fathervar child = new Child('son', 'father'); 7. 实现一个JS函数柯里化 什么是柯里化？ 在计算机科学中，柯里化（Currying）是把接受多个参数的函数变换成接受一个单一参数（最初函数的第一个参数）的函数，并且返回接受余下的参数且返回结果的新函数的技术。 函数柯里化的主要作用和特点就是参数复用、提前返回和延迟执行。 7.1 通用版function curry(fn, args) { var length = fn.length; var args = args || []; return function(){ newArgs = args.concat(Array.prototype.slice.call(arguments)); if (newArgs.length &lt; length) { return curry.call(this,fn,newArgs); }else{ return fn.apply(this,newArgs); } }}function multiFn(a, b, c) { return a * b * c;}var multi = curry(multiFn);multi(2)(3)(4);multi(2,3,4);multi(2)(3,4);multi(2,3)(4); 7.2 ES6写法const curry = (fn, arr = []) =&gt; (...args) =&gt; ( arg =&gt; arg.length === fn.length ? fn(...arg) : curry(fn, arg))([...arr, ...args])let curryTest=curry((a,b,c,d)=&gt;a+b+c+d)curryTest(1,2,3)(4) //返回10curryTest(1,2)(4)(3) //返回10curryTest(1,2)(3,4) //返回10 8. 手写一个 Promise (中高级必考) 我们来过一遍 Promise/A+ 规范： 三种状态 pending| fulfilled(resolved) | rejected 当处于 pending 状态的时候，可以转移到 fulfilled(resolved)或者 rejected状态 当处于 fulfilled(resolved) 状态或者 rejected 状态的时候，就不可变。 必须有一个 then 异步执行方法，then 接受两个参数且必须返回一个 promise. // onFulfilled 用来接收promise成功的值// onRejected 用来接收promise失败的原因var promise1=promise.then(onFulfilled, onRejected); 8.1 Promise 的流程图分析 来回顾下 Promise 用法： var promise = new Promise((resolve,reject) =&gt; { if (操作成功) { resolve(value) } else { reject(error) }})promise.then(function (value) { // success},function (value) { // failure}) 8.2 面试版function myPromise(constructor){ let self=this; self.status=\"pending\" //定义状态改变前的初始状态 self.value=undefined;//定义状态为resolved的时候的状态 self.reason=undefined;//定义状态为rejected的时候的状态 function resolve(value){ //两个===\"pending\"，保证了状态的改变是不可逆的 if(self.status===\"pending\"){ self.value=value; self.status=\"resolved\"; } } function reject(reason){ //两个===\"pending\"，保证了状态的改变是不可逆的 if(self.status===\"pending\"){ self.reason=reason; self.status=\"rejected\"; } } //捕获构造异常 try{ constructor(resolve,reject); }catch(e){ reject(e); }} 同时，需要在 myPromise 的原型上定义链式调用的 then 方法： myPromise.prototype.then=function(onFullfilled,onRejected){ let self=this; switch(self.status){ case \"resolved\": onFullfilled(self.value); break; case \"rejected\": onRejected(self.reason); break; default: }} 测试一下： var p=new myPromise(function(resolve,reject){resolve(1)});p.then(function(x){console.log(x)})//输出1 8.3 大厂专供版直接贴代码 const PENDING = \"pending\";const FULFILLED = \"fulfilled\";const REJECTED = \"rejected\";function Promise(excutor) { let that = this; // 缓存当前promise实例对象 that.status = PENDING; // 初始状态 that.value = undefined; // fulfilled状态时 返回的信息 that.reason = undefined; // rejected状态时 拒绝的原因 that.onFulfilledCallbacks = []; // 存储fulfilled状态对应的onFulfilled函数 that.onRejectedCallbacks = []; // 存储rejected状态对应的onRejected函数 function resolve(value) { // value成功态时接收的终值 if(value instanceof Promise) { return value.then(resolve, reject); } // 实践中要确保 onFulfilled 和 onRejected 方法异步执行，且应该在 then 方法被调用的那一轮事件循环之后的新执行栈中执行。 setTimeout(() =&gt; { // 调用resolve 回调对应onFulfilled函数 if (that.status === PENDING) { // 只能由pending状态 =&gt; fulfilled状态 (避免调用多次resolve reject) that.status = FULFILLED; that.value = value; that.onFulfilledCallbacks.forEach(cb =&gt; cb(that.value)); } }); } function reject(reason) { // reason失败态时接收的拒因 setTimeout(() =&gt; { // 调用reject 回调对应onRejected函数 if (that.status === PENDING) { // 只能由pending状态 =&gt; rejected状态 (避免调用多次resolve reject) that.status = REJECTED; that.reason = reason; that.onRejectedCallbacks.forEach(cb =&gt; cb(that.reason)); } }); } // 捕获在excutor执行器中抛出的异常 // new Promise((resolve, reject) =&gt; { // throw new Error('error in excutor') // }) try { excutor(resolve, reject); } catch (e) { reject(e); }}Promise.prototype.then = function(onFulfilled, onRejected) { const that = this; let newPromise; // 处理参数默认值 保证参数后续能够继续执行 onFulfilled = typeof onFulfilled === \"function\" ? onFulfilled : value =&gt; value; onRejected = typeof onRejected === \"function\" ? onRejected : reason =&gt; { throw reason; }; if (that.status === FULFILLED) { // 成功态 return newPromise = new Promise((resolve, reject) =&gt; { setTimeout(() =&gt; { try{ let x = onFulfilled(that.value); resolvePromise(newPromise, x, resolve, reject); // 新的promise resolve 上一个onFulfilled的返回值 } catch(e) { reject(e); // 捕获前面onFulfilled中抛出的异常 then(onFulfilled, onRejected); } }); }) } if (that.status === REJECTED) { // 失败态 return newPromise = new Promise((resolve, reject) =&gt; { setTimeout(() =&gt; { try { let x = onRejected(that.reason); resolvePromise(newPromise, x, resolve, reject); } catch(e) { reject(e); } }); }); } if (that.status === PENDING) { // 等待态 // 当异步调用resolve/rejected时 将onFulfilled/onRejected收集暂存到集合中 return newPromise = new Promise((resolve, reject) =&gt; { that.onFulfilledCallbacks.push((value) =&gt; { try { let x = onFulfilled(value); resolvePromise(newPromise, x, resolve, reject); } catch(e) { reject(e); } }); that.onRejectedCallbacks.push((reason) =&gt; { try { let x = onRejected(reason); resolvePromise(newPromise, x, resolve, reject); } catch(e) { reject(e); } }); }); }}; 9. 手写防抖(Debouncing)和节流(Throttling) scroll 事件本身会触发页面的重新渲染，同时 scroll 事件的 handler 又会被高频度的触发, 因此事件的 handler 内部不应该有复杂操作，例如 DOM 操作就不应该放在事件处理中。针对此类高频度触发事件问题（例如页面 scroll ，屏幕 resize，监听用户输入等），有两种常用的解决方法，防抖和节流。 9.1 防抖( Debouncing )实现典型例子：限制 鼠标连击 触发。 一个比较好的解释是： 当一次事件发生后，事件处理器要等一定阈值的时间，如果这段时间过去后 再也没有 事件发生，就处理最后一次发生的事件。假设还差 0.01 秒就到达指定时间，这时又来了一个事件，那么之前的等待作废，需要重新再等待指定时间。 // 防抖动函数function debounce(fn,wait=50,immediate) { let timer; return function() { if(immediate) { fn.apply(this,arguments) } if(timer) clearTimeout(timer) timer = setTimeout(()=&gt; { fn.apply(this,arguments) },wait) }} 结合实例：滚动防抖 // 简单的防抖动函数// 实际想绑定在 scroll 事件上的 handlerfunction realFunc(){ console.log(\"Success\");}// 采用了防抖动window.addEventListener('scroll',debounce(realFunc,500));// 没采用防抖动window.addEventListener('scroll',realFunc); 9.2 节流( Throttling )实现 可以理解为事件在一个管道中传输，加上这个节流阀以后，事件的流速就会减慢。实际上这个函数的作用就是如此，它可以将一个函数的调用频率限制在一定阈值内，例如 1s，那么 1s 内这个函数一定不会被调用两次. 简单的节流函数: function throttle(fn, wait) { let prev = new Date(); return function() { const args = arguments; const now = new Date(); if (now - prev &gt; wait) { fn.apply(this, args); prev = new Date(); } }} 9.3 结合实践通过第三个参数来切换模式。 const throttle = function (fn, delay, isDebounce) { let timer; let lastCall = 0; return function (...args) { if (isDebounce) { if (timer) clearTimeout(timer); timer = setTimeout(() =&gt; { fn(...args); }, delay); } else { const now = new Date().getTime(); if (now - lastCall &lt; delay) return; lastCall = now; fn(...args); } }} 10. 手写一个 JS 深拷贝 10.1 最简版var newObj = JSON.parse( JSON.stringify( someObj )); 10.2 面试版function deepCopy(obj){ //判断是否是简单数据类型， if(typeof obj == \"object\"){ //复杂数据类型 var result = obj.constructor == Array ? [] : {}; for(let i in obj){ result[i] = typeof obj[i] == \"object\" ? deepCopy(obj[i]) : obj[i]; } }else { //简单数据类型 直接 == 赋值 var result = obj; } return result;} 11. 实现一个 instanceOf function instanceOf(left,right) { let proto = left.__proto__; let prototype = right.prototype while(true) { if(proto === null) return false if(proto === prototype) return true proto = proto.__proto__; }}","link":"/JavaScript手写代码无敌秘籍/"},{"title":"若无舍，怎有得","text":"人生是一个成长的过程，学会舍与得，方是大智慧！人这一生，都有因果。 不付出，就不会有收获；不懂得舍去，就不会有得到。 有一天，渔夫在捕鱼，一只茑鸟飞下，叼走了一条鱼。 无数只乌鸦看到鱼都想得到，便追逐茑乌。茑鸟不论怎么飞，漫天的乌鸦都紧追不舍。 茑鸟无处可逃，几乎到了绝境，生怕自己一不小心就被啄得死无葬身之地。 又惊又怕之下，鱼从嘴里掉了下来，无数的乌鸦朝着鱼落下的方向继续追逐。 茑鸟如释重负，落在树枝上休息，心想： “我背负这条鱼，让我恐惧烦恼；现在没有了这条鱼，反而内心平静，没有忧愁。” 享了不该享的福，终归要吃不该吃的苦。 人生，注定是有舍有得，在舍与得之间，有小欢喜也有大智慧。 学会舍去，能让山重水复的人生豁然开朗、柳暗花明。 星云大师曾说：凡是大善之人都能舍，凡是大智之人都敢舍。 他在书中分享过这样一个小故事。 从前有两个人，一路跋涉，披荆斩棘，终于找到了传说中宝藏所在地，没想到，那里空无一人。 正当他们疑惑不解时，空中传来了一个声音：“你们下辈子想做什么？说出心愿，我就能帮助你们实现。” 一个人激动不已，抢先说道：“忙碌了这么多年，下辈子，我希望什么都不用干，天天都有人给我钱财和食物。” 另一个人沉吟许久才说：“我能有今天，多亏善心人相助，下辈子，我希望我有足够的能力，每天都帮助一个人。” 没过多久，空中那个声音说：“你们的愿望都会实现的。” 故事的结局出乎很多人意料。 那个不舍得吃苦、想坐享其成的人，下辈子成了乞丐。 如他所愿，天天都会有人施舍食物与金钱给他。 而那个一心想着给予的人，下辈子成了一个富翁。 财力不菲，乐善好施，专门接济别人。 你看，太过拘泥于身外之物，不舍得给予他人，不舍得抛开杂念，最后的结局，是聪明反被聪明误。 你人生中所有的失去，都会以另一种方式回到你的生命里。 所谓“舍得”，有舍才有得。有时，你看似舍弃了眼前的利益，但得到的是未来更广阔的舞台。 如果将拥有的攥得太紧，那么我们又怎么能张开双手拥抱更广阔的世界呢？ 人生如海，正是有权衡过后的舍弃，有反思过后的放下，才会有千金散尽还复来的畅快，有天生我材必有用的豪迈。 早在两千多年前，孟子就道出了那句著名的“选择题”。 鱼，我所欲也，熊掌，亦我所欲也，二者不可得兼，舍鱼而取熊掌者也。 生，我所欲也，义，亦我所欲也，二者不可得兼，舍生而取义者也。 很多时候，我们烦恼，我们纠结，我们当断不断反受其乱，都来自于不懂“断舍离”。 断，就是断开不健康的生活； 舍，就是舍去沉迷物质享受的杂念； 离，就是离开人云亦云的评判标准。 再多的优柔寡断，不如一次干净利落的舍弃。 当我们舍去浮华外物，舍去不相干的枝枝蔓蔓，就会发现，要想得到内心的平静，真的很简单。 一颗平常心，任它苦辣酸甜，照样活得潇洒自在。 家有良田华厦，未必使人了却恐惧；日日珍馐美酒，难保凡人健康无病；舍去妄念，才能让人得到最珍贵的“心安”二字。 心安，东南西北都好；心安，粗茶淡饭有味；心安，方丈陋室也是大千世界。 泰戈尔曾说：“有一个夜晚，我烧毁了所有记忆，从此我的梦就透明了；有一个早晨，我扔掉了所有昨天，从此我的脚步就轻盈了。” 人生是一个成长的过程，学会舍与得，方是大智慧。","link":"/夜读20191031/"}],"tags":[{"name":"localStorage","slug":"localStorage","link":"/tags/localStorage/"},{"name":"sessionStorage","slug":"sessionStorage","link":"/tags/sessionStorage/"},{"name":"夜读","slug":"夜读","link":"/tags/夜读/"},{"name":"美文","slug":"美文","link":"/tags/美文/"},{"name":"励志","slug":"励志","link":"/tags/励志/"},{"name":"javaScript","slug":"javaScript","link":"/tags/javaScript/"},{"name":"面试","slug":"面试","link":"/tags/面试/"},{"name":"算法","slug":"算法","link":"/tags/算法/"},{"name":"JSON.stringify","slug":"JSON-stringify","link":"/tags/JSON-stringify/"},{"name":"JSON.parse","slug":"JSON-parse","link":"/tags/JSON-parse/"},{"name":"call/apply/bind","slug":"call-apply-bind","link":"/tags/call-apply-bind/"},{"name":"柯里化","slug":"柯里化","link":"/tags/柯里化/"},{"name":"Promise","slug":"Promise","link":"/tags/Promise/"},{"name":"节流/防抖","slug":"节流-防抖","link":"/tags/节流-防抖/"},{"name":"深拷贝","slug":"深拷贝","link":"/tags/深拷贝/"},{"name":"继承","slug":"继承","link":"/tags/继承/"},{"name":"instanceOf","slug":"instanceOf","link":"/tags/instanceOf/"}],"categories":[{"name":"javaScript","slug":"javaScript","link":"/categories/javaScript/"},{"name":"夜读","slug":"夜读","link":"/categories/夜读/"},{"name":"localStorage","slug":"javaScript/localStorage","link":"/categories/javaScript/localStorage/"},{"name":"美文","slug":"夜读/美文","link":"/categories/夜读/美文/"},{"name":"sessionStorage","slug":"javaScript/localStorage/sessionStorage","link":"/categories/javaScript/localStorage/sessionStorage/"},{"name":"美文","slug":"美文","link":"/categories/美文/"},{"name":"面试","slug":"javaScript/面试","link":"/categories/javaScript/面试/"},{"name":"算法","slug":"javaScript/面试/算法","link":"/categories/javaScript/面试/算法/"}]}