{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"link","text":"","link":"/link/index.html"},{"title":"tages","text":"","link":"/tages/index.html"},{"title":"测试代码","text":"","link":"/测试代码/index.html"}],"posts":[{"title":"心越简单，人越幸福","text":"幸福有时真的很简单 曾经总以为，要想获得幸福，需要许多外在物质的支撑。 可随着年龄的增长，你逐渐会发现，幸福更多时刻，只是一种内心的感受，与金钱名利无关。 当你拖着疲惫的身躯，加班回到家，发现城市的万千灯火里，能有一盏灯为你亮时。 当你生病住院时，能有个人陪在你身旁，为你熬药煮粥，对你不离不弃时。 当你感到快乐时，你可以找到一个人，分享你的喜悦。当你难过时，也有一个人，可以给你一个肩膀做依靠时。 幸福并不遥远，它近在咫尺。幸福也并不陌生，它就藏在我们熟悉的生活中，关键需要你用心地去发现和感知。 人人都有拥有幸福的权利，但如果你要求得太多，苛责得太多，抱怨得太多，就不容易找到它。 其实，你若能从琐碎的日常中，从柴米油盐的平凡日子里，提炼出美好的能力，也可以将日子开出绚烂的花儿。 你是否有这样的感觉，有时会感到很孤独。因为聊得来的人越来越少，可以交心的人也越来越少。 无论你做任何决定，有什么选择，周围的人，仿佛都不理解你，甚至他们还总是质疑你。 有时，你还会为此，有深深的挫败感。 但你总要知道，人这辈子，无法做到让所有人都满意，也不必让所有人都懂你，如果强求，只会让自己过得越来越疲惫。 一个前同事给我打来电话，诉说她这段时间，在工作中遇到的烦心事。 她不无委屈地说，为什么我做了一件好事，但员工都不理解我，他们只看得见眼前的利益，却看不见长远的打算。 我安慰她说，只要你心是善的，你的决定，也经得起时间的考验，那么无论他们是否明白，你都可以做到问心无愧。 她听后说到，现在我的心情释然了很多，至少还有你理解我。 当我们在做决定时，总被旁人的眼光和评价所左右，甚至我们也总想得到更多人的支持和认可。 后来才明白，在这个世上，懂你的人，不必你解释。不懂你的人，解释也无用。 人生有时，并不需要有那么多人懂你，你自己懂你自己，以及有那么一两个知己好友懂你，就足矣。 一个读者跟我说，她有一次帮客户去找房子，跟着中介，在炎炎夏日的街头跑了一天，不仅又累又热，双脚还磨起了泡。 但她当时最大的感受，反而不是抱怨身体上吃的苦，而是突然感觉到自己平时真的太幸福了。 曾经她总对自己的工作不满意，比如任务重，压力大，考核严。那时，她总拿自己，跟那些高薪高职的人相比，于是越比心里就越不平衡。 可她现在才知道，原来在这个世界上，还有比她更辛苦，更忙碌，更劳碌的人，并没有她那么好的工作条件，可以不用日晒雨淋，可以有节庆双休，也拥有更多时间上的自由。 因为她总看到，别人有着比她更优越的条件，所以会心生嫉妒，但她却没有看到别人付出的比她多。同时，她也并不知道，只要你尽自己所能，干好自己应该干的，哪怕是一件看起来微不足道的小事，也算是成功。","link":"/ceshiyixia/"},{"title":"欢迎来到召唤","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post$ hexo new \"My New Post\" More info: Writing Run server$ hexo server More info: Server Generate static files$ hexo generate More info: Generating Deploy to remote sites$ hexo deploy More info: Deployment","link":"/hello-world/"}],"tags":[{"name":"夜读","slug":"夜读","link":"/tags/夜读/"},{"name":"美文","slug":"美文","link":"/tags/美文/"}],"categories":[{"name":"美文","slug":"美文","link":"/categories/美文/"}]}