{"pages":[{"title":"关于我！","text":"大家好，我是一名前端工程师，每天会根据时间更新一下自己的博客，内容是自己所学亦或是从别处理解之个人见解，前端道路漫长，有趣之中也会有很多烦躁，所以也会更新一下夜读美文，或者经典语句，夜深人静之时，解解闷儿。","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"link","text":"","link":"/link/index.html"}],"posts":[{"title":"测试","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post var EventConstants = _dereq_(16); var EventPropagators = _dereq_(20);var ExecutionEnvironment = _dereq_(147);var FallbackCompositionState = _dereq_(21);var SyntheticCompositionEvent = _dereq_(102);var SyntheticInputEvent = _dereq_(106);var keyOf = _dereq_(165);var END_KEYCODES = [9, 13, 27, 32]; // Tab, Return, Esc, Spacevar START_KEYCODE = 229;for(let i = 0, iSize = 10; i &lt; iSize; i ++&gt;){ this.newArr.push({ name: 'ni', age: 25 })} Run server$ hexo server Generate static files$ hexo generate Deploy to remote sites$ hexo deploy","link":"/hello-world/"},{"title":"世界再大，也不如有人等你回家","text":"世界上最美的风景，是回家的路！最近，一则90秒的短片在朋友圈刷屏，让无数人为之动容。 夜晚，灯火阑珊。女主角依然为了工作忙得不可开交。 这样的情形，已经成了现代城市年轻人的一个缩影。 节日到了，母亲希望女儿回家一趟，言外之意还有让她相亲的意思。 但是女主角并不愿意父母干涉自己的事儿，无奈之下只好借口出游躲避回家后的“麻烦”。 当假期如约而至，女主角开始踏上自己的旅程。 旅途上的一个小插曲，无意间触动了她心中的那一份柔软： 高速路服务区，一位技工小哥，在帮她检测车辆的时候，收到了家中的电话。 为了坚守自己的岗位，方便大家的出行，就连节假日他也无法抽身回乡。与此同时，女主角的母亲也再次给她发来关心的短信。 直到这一刻女主角才发现，原来有些近在咫尺的幸福，于另外一些人而言，却是一种奢望。 视频的最后，当女主开始踏上回家旅程的那一刻，我的心中也仿佛有一块石头重重地落下。 原来，这个世界再大，也不如有人等你回家。 上周，我刚到办公室，就发现同事群里一阵骚乱。 原来国庆临近，很多同事都没有抢到火车票，有的撺掇着拼车回家，有的忙着发送抢票链接，一片慌乱。 在外工作多年，这样的场景早就是一种常态，本来我不以为意，但是同事小艾还是引起了我的注意。 小艾是公司来的新人，脾气倔得很，因为毕业后的择业问题与父母产生了一些矛盾，所以来北京这几年，即便步履维艰，她也很少回家。 但是这一次，我却见到了她在同事群连发了三条“求救信息”： “哥哥姐姐们，求加速，抢不到回家的车票啦。” 后面还缀上了一个大哭的表情。 后来，我们吃饭聊天，她说起这一件小事，不仅让她备受感动，恍然大悟，也让我感触颇深。 原来中秋的前一天是小艾的生日，她本以为自己又要孤独地长大一岁。可就在她上一秒还在和父母通电话，说放假不能回家时，公寓的门铃突然响起。 开门的那一刻，她无论如何都不会想到，外面站着的竟然是从千里之外风尘仆仆赶来的父母。 望着他们手里提着那盒她最喜欢吃的水果蛋糕，小艾瞬间泪目。 的确，父母和子女之间必将经历一场又一场的别离，但是彼此的爱不会因为距离而衰减。 他们希望你过得好，盼着你变强大，哪怕就此离家越来越远，他们也会想尽办法来到你的身边。 小艾最后告诉我：“以后每个假期我都要回家。”语气充满了坚定，也充满了幸福。 当我们努力去踏遍千山万水的时候，千万别忘了回头看一看那个随时等你回家的人。 你还记得上一次回家探望他们是什么时候吗？ 你还记得上一次打电话给他们是什么时候吗？ 你还记得上一次真正和他们敞开心扉聊天是什么时候吗？…… 很喜欢这样一首小诗： 我们的世界很大，常忽略了他们。父母的世界很小，只装满了我们。 他们经常忘了，我们已经长大。就像我们经常忘了，他们已经渐渐白发。 诚然，外面的世界很精彩，但父母绝对不应该成为被我们遗忘的一部分。 因为一直以来，只有他们才会用最笨拙的方式默默地守护着我们。 无论你身处何种境遇，父母对孩子总是充满了牵挂。 并且也终于发现不知不觉那个等自己回家的人已经渐渐老去，自己亏欠他们太多太多。 我们总说来日方长，可人生哪来那么多后会有期。 世间最美好莫过于：我已长大，你还未老；我有能力报答，而你仍然健康。 有人问“逢年过节，为什么中国人总要不远万里回家？” 知乎上有个高赞回答，只有一句话，却触动人心： 因为那是我的“家”呀，别的地方只能叫做“住的地方”。 在网上看到过这样一个故事： 因为刚刚毕业，女孩一直没能找到工作，到了年底想要回乡，身上只剩下几百块钱。 路途遥远，她买不起机票，只好买最便宜的绿皮火车票，需要在硬座上待三十几个小时。 等她终于赶回家乡的城市，早已经是凌晨一点。 但是没想到，她刚一出站，就看到了在站台上翘首以盼的父亲。 深夜的车站人烟稀少，父亲缩着脖子，哈气搓手。看到她出现，小跑着过来。 接过行李的时候，父亲说：“外面混得不好就回来，爸养你。长了不敢说，养你到40岁，爸还是有这个能力的。” 听到父亲的话，她特别想哭，心里一直堵着难过，在到家的那一刻，突然释放了。 有人说，家是一个有温度的词，它不仅是我们身体休息的地方，更是我们心灵停靠的港湾。倦鸟归林、鱼翔浅底、落叶归根，这都是对家的渴望，也是生命在追寻着的一种归宿。 你终会发现，你心中最美的风景，不是霓虹闪烁，也不是高楼大厦，而是那个有父母等你回去，无论贫穷或富有的家。","link":"/夜读20191005/"},{"title":"活在当下，给自己找到一个恰到好处的位置","text":"有一部电影叫《遗愿清单》，讲了一个身价千万的富人和普通的汽车维修工同时患上了癌症，住进了一家医院，他们俩在病床上等待着即将来临的死亡，临终前回忆自己的一生真的过得快乐吗？ 富人一辈子为事业打拼，离过几次婚，不缺女人，尽管有钱但也没有真正的朋友和亲人，所以感到内心空虚，穷人一辈子抚养三个孩子，为了孩子放弃了很多自己喜欢的东西，省吃俭用把自己的一生奉献给了家庭，而自己还有很多遗憾。他们两个身份地位截然不同，但是在死亡面前却是平等的。 于是二人决定在人生最后的6个月里列下遗愿清单，为自己活一次，去做这一辈子觉得遗憾的事。 他们去高空跳伞，去飙车，去万里长城，去埃及金字塔，去埃塞俄比亚看野生动物，去喜马拉雅山目睹神迹，去出于善意帮助陌生人，去亲吻世界上最美的女孩，一段看世界的游历过后他们把最后的时光留给了家人。 他们收获了整个世界，最重要的事在人生最后的阶段，拥有了一段真挚无比的友情。 去世后他们二人的骨灰装在了最爱的咖啡罐头里，埋在了喜马拉雅山上。 电影带有浪漫的戏剧色彩，但也给我们的生活带来一些思考，人的生命有限，要在有限的生命里尽可能的去充实自己，去做自己喜欢的事，我们没有办法决定人生的长短，但至少可以决定人生厚度。 无论贫穷还是富贵，走到人生边上的时候，才发现人生被太多物质的外在的事物捆绑，而真正让自己快乐的是为自己活一次，我们甚至不知道明天和死亡哪一个先来，活在当下，做自己想做的事，去经历这段人生后所收获的爱情、友情、亲情。 我时常会想到人生，想到死亡。 在苍茫的宇宙里，如果有一双眼睛要怎样才能找到我，比一粒尘埃还要细微，即便是珠穆朗玛峰乃至整个地球，在银河系在星系团中也是沧海一粟。人类的微不足道常常让我产生一种虚无感，感觉活着做的一切都没有意义。 放大了尺度来看，生活即使虚无的，每个人都在命运的摆布下无力的生活着。恰恰因为如此，我们就应该活在当下，因为我们只存在于当下，人生是由无数个当下组成的，人应当在短暂的生命力找到自己恰到好处的位置。 我喜欢的作家张晓风在她新书《回首风烟》里阐述了她对自然的存在，生命的存在、时间的存在的哲学思辨，她写道：树在，山在，大地在，岁月在，我在。你还想要怎样更好的世界。她在书中用暖心的笔墨描绘她一生中的见闻和感悟，用人生大半辈子的经历告诫我们处事的智慧和乐观的生活态度。热爱当下的生活，享受当下的人生。 宇宙是浩瀚的，人生是虚无的。那我们生活的意义就在于，在当下有花草树木，有山水江河，有时间流淌，有爱人，有自己，尽管随着时间流转这些将会消逝，但至少当下这些是难得可贵的，是美好的。 把握住当下，活在现在，找准自己的位置，去行动，去感受自然，去珍惜身边可贵的人们，生命才会变得更加充实，自在。 有个故事这样讲道：有个小和尚，每天早上负责清扫寺院里的落叶。 清晨起床扫落叶实在是一件苦差事，尤其在秋冬之际，每一次起风时，树叶总随风飞舞。每天早上都需要花费许多时间才能清扫完树叶，这让小和尚头痛不已。他一直想要找个好办法让自己轻松些。 后来有个和尚跟他说：“你在明天打扫之前先用力摇树，把落叶统统摇下来，后天就可以不用扫落叶了。”小和尚觉得这是个好办法，于是隔天他起了个大早，使劲地猛摇树，这样他就可以把今天跟明天的落叶一次扫干净了。一整天小和尚都非常开心。 第二天，小和尚到院子里一看，他不禁傻眼了。院子里如往日一样满地落叶。 老和尚走了过来，对小和尚说：“傻孩子，无论你今天怎么用力，明天的落叶还是会飘下来。” 小和尚终于明白了，世上有很多事是无法提前的，不管人们怎么为未来担忧，也无法避免未来的可能性，惟有认真地活在当下，做好今天的每一件事，未来的交给未来的自己，才是最真实的人生态度。 克里希拉姆提说过：“所谓活在当下，就是在刹那间领会其中的美与喜悦，而不眷恋它所带来的快感。” 就像我们去看绘画展览，很多人路过一个景点就赶紧拿出手机拍照，希望留作纪念，想着能够给未来的自己看，而却忽视了这幅作品在你面前的那一刻给你带来的震撼和思考。 世界上有很多美转瞬即逝，有很多人匆匆路过就再也遇不见，所以我们要找准自己的位置，不要多虑未知之事，不要去奢望不能之事。做好当下的事，不要去等，去尽可能的去做想做之事。 因为当这个世界把自己呈现在我们面前的那一刻，我们可以喊出：我在！","link":"/美文20191006-01/"},{"title":"一个人越过越好的6个迹象","text":"活成自己喜欢的样子！看到一句很有道理的话：一个人最好的状态莫过于，眼里写满了故事，脸上却不见风霜，不羡慕谁，不嘲笑谁，也不依赖谁。只是悄悄地努力，吞下委屈，喂大格局，活成自己喜欢的样子。 深以为然。 生活不需要太多事参与，故事不需要讲给太多人听。一个人安安静静努力，慢慢靠近自己想要的生活，就足矣。 生活越来越舒服，人生越过越成熟，自己越活越坦然的六个迹象，来看看，你中了几条？ 第一条，明白赚钱的重要性，但不把攒钱当作唯一目的。 亦舒说：记得积蓄，那样有朝一日失去任何人的欢心，都可以不愁衣食地伤春悲秋，缅怀过去。 的确，你不必特别有钱，但一定不能特别缺钱。钱不是万能的，但手里多一点钱，真的能叫自己少吃些苦。 赚钱和积蓄真的是很重要的事情。 不过，我希望你也要记得，别把攒钱当作唯一目的。 银行卡上的数字不应该成为你全部的安全感来源。 这世界，除了柴米油盐，还有远方的诗和田野。 不要总是低着头朝前走，偶尔停下脚步抬头看看满天的繁星。 想想自己当下最期待的生活是什么样的，不要忘记自己年少时的初心。 就像《流金岁月》中说的：无论做什么，记得为自己而做，那就毫无怨言。 人只活一辈子，不要太苛待自己，在能力范围之内给自己更好的，也是对生命的一种馈赠。 第二条，不害怕接近爱，也不盲目付出爱。 人活在世上，总免不了经历七情六欲，亲情、爱情、友情，点头之交，擦肩陌路…… 相遇和离别，每天都在上演。 以前总想着让认识的人都喜欢自己，想和更多的人成为朋友。 待人友善是修养，独来独往是性格。你不懂我，我不怪你，淡然远之，各自安好。 不害怕与人相处，也不惧于接受谁的好感和爱意。 但绝不会因为年龄或者一些本心之外的东西选择将就一段生活。 明白自己的感情很贵，不是谁都能给，如果不值得，如果没回应，那就算了。 余生很贵，取悦好自己，照顾好值得放在心上的人，不要将就，更别浪费。 第三条，比起无聊的消遣，更愿意独处和读书。 很多快速的东西往往都很短暂，偷走了你当下的时间，却并不能在你心里留下更深刻的印象。 偶尔小幅度的放纵可以让人感到愉悦和放松，但如果把堕落当成一种快乐，时间久了，只会让自己越来越难于开始自律。 没事早点睡，有空多读书，一个人的时候别浮躁，别焦虑；沉下心去磨一磨自己的脾气和性子，在书里见天地，见众生，更见自我。 要让自己成为一块有棱角但不锋芒外露，有骨气但外表温凉柔润的美玉。 你读过的书、走过的路和爱过的人，都会成为你人生路上的指路牌。那些也许你已经忘记了的书里的片段，其实都在指引你前行的方向。它们一定会在未来的某一个时刻，帮助你表现得更出色。 所以，要主动把自己从垃圾快乐中解救出来，独处和读书，往后余生，且行且记。 第四条，懂得自律才是自由的前提，并愿意为之付诸努力。 看过这样一句话：生活中的不如意总比如意多。 而对此的恪守、热情，恰恰也缘于自身的坚韧。时刻提醒自己，要自律，要保持内在的从容与安静。 无论在人生的哪个阶段，都不能放弃成长，没有人能限制你人生的高度，只要你不要让心受限，一切都有可能。 康德说：自律即自由。 先有自律，懂得隐忍和克制，放弃一些不重要的，坚持一些优秀的；而后才能因此获得真正的自由，成为自己想要的样子。 坚持一件能够让自己变好的事的确不容易，打磨自己的过程也总是充满了艰难和迷茫。 但只要你在朝前走，只要你在朝着更优秀的方向拼搏，即使最后失败，也是最难能可贵的经历。 思考、行动、自律、坚持，共勉。 要相信，勇于大步向前走的人，总能够找到属于自己的光亮。 第五条，有些人该放就放。 人生就像一条路，从起点出发，到终点结束，不长不短刚刚好。 但在开始时，我们因过于懵懂而无法抉择，可待到结束时，回望一生却总觉得有诸多悔恨。 其实未来和过去，都不是我们该看重的东西，时光飞逝，只该抓紧今日。 珍惜现在拥有的人和事，感恩如今生命馈赠的一切，得不到的就不要去想它，已经失去的，就赶紧放下吧。 有些事得过且过，有些人该忘就忘。 别因为一时的失意就沉沦放纵，也别把悲伤和难过郁结在心里。 生活本就很苦了，但你可以学着做自己的草莓味儿； 保持健康的身体和积极的心灵，从每一个当下开始，期许新生活。 第六条，先爱自己，而后爱人。 坚持读书，写字，听歌，旅行，上网，摄影，有时唱歌，跳舞，打扫，烹饪，约会，狂欢。” 无论遇见什么，人生都在照常运转，无论离开了谁，生活也不能停滞不前。 不懂先为自己付出的人，就算为别人掏心掏肺，也会被当作理所当然； 不懂先爱自己的人，就算把自己感动得痛哭流涕，也无法真正拥有合适的爱情和生活。 先爱自己，而后爱人。 如此，便能够为了开心而保持微笑，为了幸福而变得坚韧；如此便不会为了一个不值得的人伤神沉沦，不会为了不必要的事大动肝火。 只此一世，取悦自己，真的很重要。 希望你也成为这样的人，眼里长着太阳，笑里全是坦荡。余生漫漫，且行且成长，且行，珍惜。","link":"/美文20191006/"},{"title":"心越简单，人越幸福","text":"幸福有时真的很简单！曾经总以为，要想获得幸福，需要许多外在物质的支撑。 可随着年龄的增长，你逐渐会发现，幸福更多时刻，只是一种内心的感受，与金钱名利无关。 当你拖着疲惫的身躯，加班回到家，发现城市的万千灯火里，能有一盏灯为你亮时。 当你生病住院时，能有个人陪在你身旁，为你熬药煮粥，对你不离不弃时。 当你感到快乐时，你可以找到一个人，分享你的喜悦。当你难过时，也有一个人，可以给你一个肩膀做依靠时。 幸福并不遥远，它近在咫尺。幸福也并不陌生，它就藏在我们熟悉的生活中，关键需要你用心地去发现和感知。 人人都有拥有幸福的权利，但如果你要求得太多，苛责得太多，抱怨得太多，就不容易找到它。 其实，你若能从琐碎的日常中，从柴米油盐的平凡日子里，提炼出美好的能力，也可以将日子开出绚烂的花儿。 你是否有这样的感觉，有时会感到很孤独。因为聊得来的人越来越少，可以交心的人也越来越少。 无论你做任何决定，有什么选择，周围的人，仿佛都不理解你，甚至他们还总是质疑你。 有时，你还会为此，有深深的挫败感。 但你总要知道，人这辈子，无法做到让所有人都满意，也不必让所有人都懂你，如果强求，只会让自己过得越来越疲惫。 一个前同事给我打来电话，诉说她这段时间，在工作中遇到的烦心事。 她不无委屈地说，为什么我做了一件好事，但员工都不理解我，他们只看得见眼前的利益，却看不见长远的打算。 我安慰她说，只要你心是善的，你的决定，也经得起时间的考验，那么无论他们是否明白，你都可以做到问心无愧。 她听后说到，现在我的心情释然了很多，至少还有你理解我。 当我们在做决定时，总被旁人的眼光和评价所左右，甚至我们也总想得到更多人的支持和认可。 后来才明白，在这个世上，懂你的人，不必你解释。不懂你的人，解释也无用。 人生有时，并不需要有那么多人懂你，你自己懂你自己，以及有那么一两个知己好友懂你，就足矣。 一个读者跟我说，她有一次帮客户去找房子，跟着中介，在炎炎夏日的街头跑了一天，不仅又累又热，双脚还磨起了泡。 但她当时最大的感受，反而不是抱怨身体上吃的苦，而是突然感觉到自己平时真的太幸福了。 曾经她总对自己的工作不满意，比如任务重，压力大，考核严。那时，她总拿自己，跟那些高薪高职的人相比，于是越比心里就越不平衡。 可她现在才知道，原来在这个世界上，还有比她更辛苦，更忙碌，更劳碌的人，并没有她那么好的工作条件，可以不用日晒雨淋，可以有节庆双休，也拥有更多时间上的自由。 因为她总看到，别人有着比她更优越的条件，所以会心生嫉妒，但她却没有看到别人付出的比她多。 同时，她也并不知道，只要你尽自己所能，干好自己应该干的，哪怕是一件看起来微不足道的小事，也算是成功。 其实，大多数人的不快乐，往往来源于爱比较和不知足。 凡事你若争强好胜，只会让自己越来越痛苦。 但若你懂得，怀着一颗感恩的心，去珍惜你的工作，去善待你的生活，那么你就会多一分坦然和快乐。 虽然每个人对幸福的定义不一样，但幸福的感受，往往是相似的，想要获得幸福的心，也是相同的。 也许我们会因为各种条件，机遇和环境的不同，而过上截然不同的人生，但只要我们学会给心灵减负，学会控制欲望，学会不去盲目攀比，就会让自己活得更加轻松愉快。 其实，幸福有时真的很简单。 比如你拥有一份稳定的工作，虽然它需要你忙一点，累一点，辛苦一点，但它可以让你去实现自己的人生价值，也可以让你有底气和资本去挣钱养家。 比如你拥有一个和睦的家庭，虽然父母观念老一点，孩子调皮一点，另一半的脾气大一点，但家人闲坐，灯火可亲的感觉，是那么难能可贵。 比如你拥有几个可以互诉衷肠的朋友，虽然他们有时并不能给你及时的安慰和陪伴，又或者你们之间有些小矛盾，但能有哪怕一个交心的知己，也是人生一大幸事。 但如果你将幸福看得太复杂，你的内心太浑浊，你用恶意去揣测你所遇到的人和事，那么你就会感到十分压抑和痛苦。 其实当一个人，少一些世故，多一些单纯；少一些套路，多一些真诚；少一些浮躁，多一些宁静；就会活得更加澄明、坦率和自由。","link":"/夜读20191004/"}],"tags":[{"name":"夜读","slug":"夜读","link":"/tags/夜读/"},{"name":"美文","slug":"美文","link":"/tags/美文/"},{"name":"励志","slug":"励志","link":"/tags/励志/"},{"name":"HTML","slug":"HTML","link":"/tags/HTML/"},{"name":"javaScript","slug":"javaScript","link":"/tags/javaScript/"},{"name":"前端","slug":"前端","link":"/tags/前端/"},{"name":"CSS","slug":"CSS","link":"/tags/CSS/"},{"name":"js","slug":"js","link":"/tags/js/"}],"categories":[{"name":"美文","slug":"美文","link":"/categories/美文/"},{"name":"夜读","slug":"夜读","link":"/categories/夜读/"},{"name":"美文","slug":"夜读/美文","link":"/categories/夜读/美文/"},{"name":"HTML","slug":"HTML","link":"/categories/HTML/"},{"name":"javaScript","slug":"HTML/javaScript","link":"/categories/HTML/javaScript/"},{"name":"前端","slug":"HTML/javaScript/前端","link":"/categories/HTML/javaScript/前端/"},{"name":"CSS","slug":"HTML/javaScript/前端/CSS","link":"/categories/HTML/javaScript/前端/CSS/"},{"name":"前端","slug":"前端","link":"/categories/前端/"},{"name":"js","slug":"前端/js","link":"/categories/前端/js/"},{"name":"HTML","slug":"前端/js/HTML","link":"/categories/前端/js/HTML/"},{"name":"CSS","slug":"前端/js/HTML/CSS","link":"/categories/前端/js/HTML/CSS/"}]}